{
    "aerodynamics": "Aerodynamics (Ancient Greek: ἀήρ aero (air) + Ancient Greek: δυναμική (dynamics)) is the study of the motion of air, particularly when affected by a solid object, such as an airplane wing. It involves topics covered in the field of fluid dynamics and its subfield of gas dynamics, and is an important domain of study in aeronautics. The term aerodynamics is often used synonymously with gas dynamics, the difference being that \"gas dynamics\" applies to the study of the motion of all gases, and is not limited to air. The formal study of aerodynamics began in the modern sense in the eighteenth century, although observations of fundamental concepts such as aerodynamic drag were recorded much earlier. Most of the early efforts in aerodynamics were directed toward achieving heavier-than-air flight, which was first demonstrated by Otto Lilienthal in 1891. Since then, the use of aerodynamics through mathematical analysis, empirical approximations, wind tunnel experimentation, and computer simulations has formed a rational basis for the development of heavier-than-air flight and a number of other technologies. Recent work in aerodynamics has focused on issues related to compressible flow, turbulence, and boundary layers and has become increasingly computational in nature.\n\n",
    "slipstream": "A slipstream is a region behind a moving object in which a wake of fluid (typically air or water) is moving at velocities comparable to that of the moving object, relative to the ambient fluid through which the object is moving. The term slipstream also applies to the similar region adjacent to an object with a fluid moving around it. \"Slipstreaming\" or \"drafting\" works because of the relative motion of the fluid in the slipstream.",
    "viscoelasticity": "In materials science and continuum mechanics, viscoelasticity is the property of materials that exhibit both viscous and elastic characteristics when undergoing deformation. Viscous materials, like water, resist both shear flow and strain linearly with time when a stress is applied. Elastic materials strain when stretched and immediately return to their original state once the stress is removed.\nViscoelastic materials have elements of both of these properties and, as such, exhibit time-dependent strain. Whereas elasticity is usually the result of bond stretching along crystallographic planes in an ordered solid, viscosity is the result of the diffusion of atoms or molecules inside an amorphous material.\n\n",
    "lifting": "Lifting may refer to:\n\nManual handling of loads\nRaising objects upwards, for example with lifting equipment\nWeightlifting, lifting weights for exercise and sport, including:\nOlympic weightlifting, an Olympic sport that tests explosive strength\nPowerlifting, a sport that tests limit strength\nWeight training, a way of increasing strength\nAn undesirable type of movement in the sport of racewalking\nShoplifting, an unnoticed theft of goods from an open retail establishment\nFacelifting, a type of cosmetic surgery\nLift, a morphism in mathematics\nLifting theory, a notion in measure theory\nLifting scheme (wavelets)\nLambda lifting, meta-process that defines functions independently of each other in a global scope\nTaking an inference rule in propositional logic and adapting it for predicate logic\nType lifting, adding the special null value to the scope of a type",
    "flowmeter": "Flow measurement is the quantification of bulk fluid movement.  Flow can be measured using devices called flowmeters in various ways. The common types of flowmeters with industrial applications are listed below:\n\nObstruction type (differential pressure or variable area)\nInferential (turbine type)\nElectromagnetic\nPositive-displacement flowmeters, which accumulate a fixed volume of fluid and then count the number of times the volume is filled to measure flow.\nFluid dynamic (vortex shedding)\nAnemometer\nUltrasonic flow meter\nMass flow meter (Coriolis force).\nFlow measurement methods other than positive-displacement flowmeters rely on forces produced by the flowing stream as it overcomes a known constriction, to indirectly calculate flow. Flow may be measured by measuring the velocity of fluid over a known area. For very large flows, tracer methods may be used to deduce the flow rate from the change in concentration of a dye or radioisotope.",
    "deflection": "Deflection or deflexion may refer to:",
    "drosophila": "Drosophila (), from Ancient Greek δρόσος (drósos), meaning \"dew\", and φίλος (phílos), meaning \"loving\", is a genus of fly, belonging to the family Drosophilidae, whose members are often called \"small fruit flies\" or pomace flies, vinegar flies, or wine flies, a reference to the characteristic of many species to linger around overripe or rotting fruit. They should not be confused with the Tephritidae, a related family, which are also called fruit flies (sometimes referred to as \"true fruit flies\"); tephritids feed primarily on unripe or ripe fruit, with many species being regarded as destructive agricultural pests, especially the Mediterranean fruit fly.\nOne species of Drosophila in particular, Drosophila melanogaster, has been heavily used in research in genetics and is a common model organism in developmental biology. The terms \"fruit fly\" and \"Drosophila\" are often used synonymously with D. melanogaster in modern biological literature. The entire genus, however, contains more than 1,500 species and is very diverse in appearance, behavior, and breeding habitat.",
    "define": "A definition is a statement of the meaning of a term (a word, phrase, or other set of symbols). Definitions can be classified into two large categories: intensional definitions (which try to give the sense of a term), and extensional definitions (which try to list the objects that a term describes). Another important category of definitions is the class of ostensive definitions, which convey the meaning of a term by pointing out examples. A term may have many different senses and multiple meanings, and thus require multiple definitions.\nIn mathematics, a definition is used to give a precise meaning to a new term, by describing a condition which unambiguously qualifies what the mathematical term is and is not. Definitions and axioms form the basis on which all of modern mathematics is to be constructed.",
    "induce": "Induce may refer to:\n\nInduced consumption\nInduced innovation\nInduced character\nInduced coma\nInduced menopause\nInduced metric\nInduced path\nInduced topology\nInduce (musician), American musician\nLabor induction, stimulation of childbirth\n\n",
    "discontinuity": "Discontinuity may refer to:\n\nDiscontinuity (casting), an interruption in the normal physical structure or configuration of an article\nDiscontinuity (geotechnical engineering), a plane or surface marking a change in physical or chemical properties in a soil or rock mass\nDiscontinuity (mathematics), a property of a mathematical function\nDiscontinuity (linguistics), a property of tree structures in theoretical linguistics\nDiscontinuity (Postmodernism), a conception of history as espoused by the philosopher Michel Foucault.\nRevolutionary breach of legal continuity\nA break in continuity (fiction), in literature\nFracture (geology), discontinuity in rocks\nDiscontinuity (transmission lines), a step in impedance causing reflections"
}