{
    "aerodynamics": "Aerodynamics (Ancient Greek: ἀήρ aero (air) + Ancient Greek: δυναμική (dynamics)) is the study of the motion of air, particularly when affected by a solid object, such as an airplane wing. It involves topics covered in the field of fluid dynamics and its subfield of gas dynamics, and is an important domain of study in aeronautics. The term aerodynamics is often used synonymously with gas dynamics, the difference being that \"gas dynamics\" applies to the study of the motion of all gases, and is not limited to air. The formal study of aerodynamics began in the modern sense in the eighteenth century, although observations of fundamental concepts such as aerodynamic drag were recorded much earlier. Most of the early efforts in aerodynamics were directed toward achieving heavier-than-air flight, which was first demonstrated by Otto Lilienthal in 1891. Since then, the use of aerodynamics through mathematical analysis, empirical approximations, wind tunnel experimentation, and computer simulations has formed a rational basis for the development of heavier-than-air flight and a number of other technologies. Recent work in aerodynamics has focused on issues related to compressible flow, turbulence, and boundary layers and has become increasingly computational in nature.\n\n",
    "slipstream": "A slipstream is a region behind a moving object in which a wake of fluid (typically air or water) is moving at velocities comparable to that of the moving object, relative to the ambient fluid through which the object is moving. The term slipstream also applies to the similar region adjacent to an object with a fluid moving around it. \"Slipstreaming\" or \"drafting\" works because of the relative motion of the fluid in the slipstream.",
    "unsteadiness": "Vertigo is a condition in which a person has the sensation that they are moving, or that objects around them are moving, when they are not. Often it feels like a spinning or swaying movement. It may be associated with nausea, vomiting, perspiration, or difficulties walking. It is typically worse when the head is moved. Vertigo is the most common type of dizziness.\nThe most common disorders that result in vertigo are benign paroxysmal positional vertigo (BPPV), Ménière's disease, and vestibular neuritis. Less common causes include stroke, brain tumors, brain injury, multiple sclerosis, migraines, trauma, and uneven pressures between the middle ears. Physiologic vertigo may occur following being exposed to motion for a prolonged period such as when on a ship or simply following spinning with the eyes closed. Other causes may include toxin exposures such as to carbon monoxide, alcohol, or aspirin. Vertigo typically indicates a problem in a part of the vestibular system. Other causes of dizziness include presyncope, disequilibrium, and non-specific dizziness.\nBenign paroxysmal positional vertigo is more likely in someone who gets repeated episodes of vertigo with movement and is otherwise normal between these episodes. Benign vertigo episodes generally last less than one minute. The Dix-Hallpike test typically produces a period of rapid eye movements known as nystagmus in this condition. In Ménière's disease there is often ringing in the ears, hearing loss, and the attacks of vertigo last more than twenty minutes. In vestibular neuritis the onset of vertigo is sudden, and the nystagmus occurs even when the person has not been moving. In this condition vertigo can last for days. More severe causes should also be considered, especially if other problems such as weakness, headache, double vision, or numbness occur.\nDizziness affects approximately 20–40% of people at some point in time, while about 7.5–10% have vertigo. About 5% have vertigo in a given year. It becomes more common with age and affects women two to three times more often than men. Vertigo accounts for about 2–3% of emergency department visits in the developed world.",
    "viscoelasticity": "In materials science and continuum mechanics, viscoelasticity is the property of materials that exhibit both viscous and elastic characteristics when undergoing deformation. Viscous materials, like water, resist both shear flow and strain linearly with time when a stress is applied. Elastic materials strain when stretched and immediately return to their original state once the stress is removed.\nViscoelastic materials have elements of both of these properties and, as such, exhibit time-dependent strain. Whereas elasticity is usually the result of bond stretching along crystallographic planes in an ordered solid, viscosity is the result of the diffusion of atoms or molecules inside an amorphous material.\n\n",
    "shock": "Shock may refer to:",
    "gust": "Gust is a given name, surname, and a shortened version of Augustus, Augusta, Gustave, August, Augustine, and Gussie and may refer to:",
    "drag": "Drag or The Drag may refer to:",
    "lifting": "Lifting may refer to:\n\nManual handling of loads\nRaising objects upwards, for example with lifting equipment\nWeightlifting, lifting weights for exercise and sport, including:\nOlympic weightlifting, an Olympic sport that tests explosive strength\nPowerlifting, a sport that tests limit strength\nWeight training, a way of increasing strength\nAn undesirable type of movement in the sport of racewalking\nShoplifting, an unnoticed theft of goods from an open retail establishment\nFacelifting, a type of cosmetic surgery\nLift, a morphism in mathematics\nLifting theory, a notion in measure theory\nLifting scheme (wavelets)\nLambda lifting, meta-process that defines functions independently of each other in a global scope\nTaking an inference rule in propositional logic and adapting it for predicate logic\nType lifting, adding the special null value to the scope of a type",
    "shear": "Shear may refer to:",
    "viscid": "An earthworm is a soil-dwelling terrestrial invertebrate that belongs to the phylum Annelida. The term is the common name for the largest members of the class (or subclass, depending on the author) Oligochaeta. In classical systems, they were in the order of Opisthopora since the male pores opened posterior to the female pores, although the internal male segments are anterior to the female. Theoretical cladistic studies have placed them in the suborder Lumbricina of the order Haplotaxida, but this may change. Other slang names for earthworms include \"dew-worm\", \"rainworm\", \"nightcrawler\", and \"angleworm\" (from its use as angling hookbaits). Larger terrestrial earthworms are also called megadriles (which translates to \"big worms\") as opposed to the microdriles (\"small worms\") in the semiaquatic families Tubificidae, Lumbricidae and Enchytraeidae. The megadriles are characterized by a distinct clitellum (more extensive than that of microdriles) and a vascular system with true capillaries.\nEarthworms are commonly found in moist, compost-rich soil, eating a wide variety of organic matters, which include detritus, living protozoa, rotifers, nematodes, bacteria, fungi and other microorganisms. An earthworm's digestive system runs the length of its body. They are one of nature's most important detritivores and coprophages, and also serve as food for many low-level consumers within the ecosystems.\nEarthworms exhibit an externally segmented tube-within-a-tube body plan with corresponding internal segmentations, and usually have setae on all segments. They have a cosmopolitan distribution wherever soil, water and temperature conditions allow. They have a double transport system made of coelomic fluid that moves within the fluid-filled coelom and a simple, closed circulatory system, and respire (breathe) via cutaneous respiration. As soft-bodied invertebrates, they lack a true skeleton, but their structure is maintained by fluid-filled coelom chambers that function as a hydrostatic skeleton.\nEarthworms have a central nervous system consisting of two ganglia above the mouth, one on either side, connected to an axial nerve running along its length to motor neurons and sensory cells in each segment. Large numbers of chemoreceptors concentrate near its mouth. Circumferential and longitudinal muscles edging each segment let the worm move. Similar sets of muscles line the gut tube, and their actions propel digested food toward the worm's anus.\nEarthworms are hermaphrodites: each worm carries male and female reproductive organs and  genital pores. When mating, two individual earthworms will exchange sperm and fertilize each other's ova.",
    "flowmeter": "Flow measurement is the quantification of bulk fluid movement.  Flow can be measured using devices called flowmeters in various ways. The common types of flowmeters with industrial applications are listed below:\n\nObstruction type (differential pressure or variable area)\nInferential (turbine type)\nElectromagnetic\nPositive-displacement flowmeters, which accumulate a fixed volume of fluid and then count the number of times the volume is filled to measure flow.\nFluid dynamic (vortex shedding)\nAnemometer\nUltrasonic flow meter\nMass flow meter (Coriolis force).\nFlow measurement methods other than positive-displacement flowmeters rely on forces produced by the flowing stream as it overcomes a known constriction, to indirectly calculate flow. Flow may be measured by measuring the velocity of fluid over a known area. For very large flows, tracer methods may be used to deduce the flow rate from the change in concentration of a dye or radioisotope.",
    "deceleration": "In mechanics, acceleration is the rate of change of the velocity of an object with respect to time. Acceleration is one of several components of kinematics, the study of motion. Accelerations are vector quantities (in that they have magnitude and direction). The orientation of an object's acceleration is given by the orientation of the net force acting on that object. The magnitude of an object's acceleration, as described by Newton's second law, is the combined effect of two causes:\n\nthe net balance of all external forces acting onto that object — magnitude is directly proportional to this net resulting force;\nthat object's mass, depending on the materials out of which it is made — magnitude is inversely proportional to the object's mass.\nThe SI unit for acceleration is metre per second squared (m⋅s−2, \n  \n    \n      \n        \n          \n            \n              m\n              \n                s\n                \n                  2\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\mathrm {\\tfrac {m}{s^{2}}} }\n  \n).\nFor example, when a vehicle starts from a standstill (zero velocity, in an inertial frame of reference) and travels in a straight line at increasing speeds, it is accelerating in the direction of travel. If the vehicle turns, an acceleration occurs toward the new direction and changes its motion vector.  The acceleration of the vehicle in its current direction of motion is called a linear (or tangential during circular motions) acceleration, the reaction to which the passengers on board experience as a force pushing them back into their seats. When changing direction, the effecting acceleration is called radial (or centripetal during circular motions) acceleration, the reaction to which the passengers experience as a centrifugal force. If the speed of the vehicle decreases, this is an acceleration in the opposite direction of the velocity vector (mathematically a negative, if the movement is unidimensional and the velocity is positive), sometimes called deceleration or retardation, and passengers experience the reaction to deceleration as an inertial force pushing them forward.  Such negative accelerations are often achieved by retrorocket burning in spacecraft. Both acceleration and deceleration are treated the same, as they are both changes in velocity. Each of these accelerations (tangential, radial, deceleration) is felt by passengers until their relative (differential) velocity are neutralised in reference to the acceleration due to change in speed.\n\n",
    "deflection": "Deflection or deflexion may refer to:",
    "transient": "Transience or transient may refer to:",
    "streamlining": "Streamline may refer to:",
    "ballistic": "A ballistic missile is a type of missile that uses projectile motion to deliver warheads on a target. These weapons are powered only during relatively brief periods—most of the flight is unpowered. Short-range ballistic missiles (SRBM) typically stay within the Earth's atmosphere, while most larger missiles travel outside the atmosphere. The type of ballistic missile with the greatest range is an intercontinental ballistic missile (ICBM). The largest ICBMs are capable of full orbital flight.\nThese missiles are in a distinct category from cruise missiles, which are aerodynamically guided in powered flight and thus restricted to the atmosphere.",
    "freestream": "The freestream is the air far upstream of an aerodynamic body, that is, before the body has a chance to deflect, slow down or compress the air. Freestream conditions are usually denoted with a \n  \n    \n      \n        ∞\n      \n    \n    {\\displaystyle \\infty }\n  \n symbol, e.g. \n  \n    \n      \n        \n          V\n          \n            ∞\n          \n        \n      \n    \n    {\\displaystyle V_{\\infty }}\n  \n, meaning the freestream velocity.",
    "tailplane": "A tailplane, also known as a horizontal stabilizer, is a small lifting surface located on the tail (empennage) behind the main lifting surfaces of a fixed-wing aircraft as well as other non-fixed-wing aircraft such as helicopters and gyroplanes. Not all fixed-wing aircraft have tailplanes. Canards, tailless and flying wing aircraft have no separate tailplane, while in V-tail aircraft the vertical stabilizer, rudder, and the tail-plane and elevator are combined to form two diagonal surfaces in a V layout.\nThe function of the tailplane is to provide stability and control. In particular, the tailplane helps adjust for changes in position of the centre of pressure or centre of gravity caused by changes in speed and attitude, fuel consumption, or dropping cargo or payload.\n\n",
    "acrothermoelasticity": null,
    "hydroballistic": "The Mk44 Bushmaster II is a 30 mm chain gun manufactured by Northrop Grumman.  It is a derivative of the 25 mm M242 Bushmaster, and uses 70% of the same parts as the M242 while increasing the firepower by as much as 50% with the 20% increase in caliber size. The barrel is chromium-plated for extended life. The gun uses standard GAU-8 Avenger ammunition that is available in API (Armor-Piercing Incendiary), HEI (High-Explosive Incendiary) and APFSDS-T (Armor-Piercing Fin-Stabilized Discarding Sabot-Tracer) variants.\nThe gun can be converted to a caliber of 40×180 mm, which involves changing the barrel and a few key parts, to use the SuperShot 40 cartridge. It can also be converted to use the 30×170 mm RARDEN cartridge.\n\n",
    "mechanism": "Mechanism may refer to:\n\nMechanism (economics), a set of rules for a game designed to achieve a certain outcome\nMechanism design, the study of such mechanisms\nMechanism (engineering), rigid bodies connected by joints in order to accomplish a desired force and/or motion transmission\nMechanism (biology), explaining how a feature is created\nMechanism (philosophy), a theory that all natural phenomena can be explained by physical causes\nMechanism (sociology), a theory that all social phenomena can be explained by the existence of a deterministic mechanism",
    "slope": "In mathematics, the slope or gradient of a line is a number that describes the direction of the line on a plane. Often denoted by the letter m, slope is calculated as the ratio of the vertical change to the horizontal change (\"rise over run\") between two distinct points on the line, giving the same number for any choice of points. \nThe line may be physical – as set by a road surveyor, pictorial as in a diagram of a road or roof, or abstract.\nAn application of the mathematical concept is found in the grade or gradient in geography and civil engineering. \nThe steepness, incline, or grade of a line is the absolute value of its slope: greater absolute value indicates a steeper line. The line trend is defined as follows: \n\nAn \"increasing\" or \"ascending\" line goes up from left to right and has positive slope: \n  \n    \n      \n        m\n        >\n        0\n      \n    \n    {\\displaystyle m>0}\n  \n.\nA \"decreasing\" or \"descending\" line goes down from left to right and has negative slope: \n  \n    \n      \n        m\n        <\n        0\n      \n    \n    {\\displaystyle m<0}\n  \n.\nSpecial directions are:\n\nA \"(square) diagonal\" line has unit slope: \n  \n    \n      \n        m\n        =\n        1\n      \n    \n    {\\displaystyle m=1}\n  \n\nA \"horizontal\" line (the graph of a constant function) has zero slope: \n  \n    \n      \n        m\n        =\n        0\n      \n    \n    {\\displaystyle m=0}\n  \n.\nA \"vertical\" line has undefined or infinite slope (see below).\nIf two points of a road have altitudes y1 and y2, the rise is the difference (y2 − y1) = Δy. Neglecting the Earth's curvature, if the two points have horizontal distance x1 and x2 from a fixed point, the run is (x2 − x1) = Δx. The slope between the two points is the difference ratio:\n\n  \n    \n      \n        m\n        =\n        \n          \n            \n              Δ\n              y\n            \n            \n              Δ\n              x\n            \n          \n        \n        =\n        \n          \n            \n              \n                y\n                \n                  2\n                \n              \n              −\n              \n                y\n                \n                  1\n                \n              \n            \n            \n              \n                x\n                \n                  2\n                \n              \n              −\n              \n                x\n                \n                  1\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle m={\\frac {\\Delta y}{\\Delta x}}={\\frac {y_{2}-y_{1}}{x_{2}-x_{1}}}.}\n  \n\nThrough trigonometry, the slope m of a line is related to its angle of inclination θ by the tangent function\n\n  \n    \n      \n        m\n        =\n        tan\n        ⁡\n        (\n        θ\n        )\n        .\n      \n    \n    {\\displaystyle m=\\tan(\\theta ).}\n  \n\nThus, a 45° rising line has slope m = +1, and a 45° falling line has slope m = −1.\nGeneralizing this, differential calculus defines the slope of a plane curve at a point as the slope of its tangent line at that point. When the curve is approximated by a series of points, the slope of the curve may be approximated by the slope of the secant line between two nearby points. When the curve is given as the graph of an algebraic expression, calculus gives formulas for the slope at each point. Slope is thus one of the central ideas of calculus and its applications to design.\n\n",
    "diaphragm": "Diaphragm may refer to:",
    "navier": "The Navier–Stokes equations ( nav-YAY STOHKS) are partial differential equations which describe the motion of viscous fluid substances.  They were named after French engineer and physicist Claude-Louis Navier and the Irish physicist and mathematician George Gabriel Stokes.  They were developed over several decades of progressively building the theories, from 1822 (Navier) to 1842–1850 (Stokes).\nThe Navier–Stokes equations mathematically express momentum balance for Newtonian fluids and make use of conservation of mass. They are sometimes accompanied by an equation of state relating pressure, temperature  and density. They arise from applying Isaac Newton's second law to fluid motion, together with the assumption that the stress in the fluid is the sum of a diffusing viscous term (proportional to the gradient of velocity) and a pressure term—hence describing viscous flow. The difference between them and the closely related Euler equations is that Navier–Stokes equations take viscosity into account while the Euler equations model only inviscid flow. As a result, the Navier–Stokes are an elliptic equation and therefore have better analytic properties, at the expense of having less mathematical structure (e.g. they are never completely integrable).\nThe Navier–Stokes equations are useful because they describe the physics of many phenomena of scientific and engineering interest. They may be used to model the weather, ocean currents, water flow in a pipe and air flow around a wing. The Navier–Stokes equations, in their full and simplified forms, help with the design of aircraft and cars, the study of blood flow, the design of power stations, the analysis of pollution, and many other problems. Coupled with Maxwell's equations, they can be used to model and study magnetohydrodynamics.\nThe Navier–Stokes equations are also of great interest in a purely mathematical sense. Despite their wide range of practical uses, it has not yet been proven whether smooth solutions always exist in three dimensions—i.e., whether they are infinitely differentiable (or even just bounded) at all points in the domain. This is called the Navier–Stokes existence and smoothness problem. The Clay Mathematics Institute has called this one of the seven most important open problems in mathematics and has offered a US$1 million prize for a solution or a counterexample.\n\n",
    "subsonically": "Subsonic may refer to:",
    "layer": "Layer or layered may refer to:",
    "illustrating": "An illustration is a decoration, interpretation, or visual explanation of a text, concept, or process, designed for integration in print and digitally published media, such as posters, flyers, magazines, books, teaching materials, animations, video games and films. An illustration is typically created by an illustrator. Digital illustrations are often used to make websites and apps more user-friendly, such as the use of emojis to accompany digital type. Illustration also means providing an example; either in writing or in picture form.\nThe origin of the word \"illustration\" is late Middle English (in the sense ‘illumination; spiritual or intellectual enlightenment’): via Old French from Latin illustratio(n-), from the verb illustrare.",
    "characteristic": "A characteristic is a distinguishing feature of a person or thing. It may refer to:",
    "sommerfeld": "Arnold Johannes Wilhelm Sommerfeld (German: [ˈaʁnɔlt ˈzɔmɐˌfɛlt]; 5 December 1868 – 26 April 1951) was a German physicist who pioneered developments in atomic and quantum physics, and also educated and mentored many students for the new era of theoretical physics. He served as doctoral supervisor and postdoc supervisor to seven Nobel Prize winners and supervised at least 30 other famous physicists and chemists. Only J. J. Thomson's record of mentorship offers a comparable list of high-achieving students.\nHe introduced the second quantum number, azimuthal quantum number, and the third quantum number, magnetic quantum number. He also introduced the fine-structure constant and pioneered X-ray wave theory.",
    "staticpressure": null,
    "electrohydrodynamic": "Electrohydrodynamics (EHD), also known as electro-fluid-dynamics (EFD) or electrokinetics, is the study of the dynamics of electrically charged fluids. Electrohydrodynamics (EHD) is a joint domain of electrodynamics and fluid dynamics mainly focused on the fluid motion induced by electric fields. EHD, in its simplest form, involves the application of an electric field to a fluid medium, resulting in fluid flow, form, or properties manipulation. These mechanisms arise from the interaction between the electric fields and charged particles or polarization effects within the fluid. The generation and movement of charge carriers (ions) in a fluid subjected to an electric field are the underlying physics of all EHD-based technologies.\n\nThe electric forces acting on particles consist of electrostatic (Coulomb) and electrophoresis force (first term in the following equation)., dielectrophoretic force (second term in the following equation), and electrostrictive force (third term in the following equation):\n\n  \n    \n      \n        \n          F\n          \n            e\n          \n        \n        =\n        \n          ρ\n          \n            e\n          \n        \n        \n          \n            E\n            →\n          \n        \n        −\n        \n          \n            1\n            2\n          \n        \n        \n          ε\n          \n            0\n          \n        \n        \n          \n            \n              E\n              →\n            \n          \n          \n            2\n          \n        \n        ▽\n        \n          ε\n          \n            r\n          \n        \n        +\n        \n          \n            1\n            2\n          \n        \n        \n          ε\n          \n            0\n          \n        \n        ▽\n        \n          \n            (\n          \n        \n        \n          \n            \n              E\n              →\n            \n          \n          \n            2\n          \n        \n        \n          ρ\n          \n            f\n          \n        \n        \n          (\n          \n            \n              \n                ∂\n                \n                  ε\n                  \n                    r\n                  \n                \n              \n              \n                ∂\n                \n                  ρ\n                  \n                    f\n                  \n                \n              \n            \n          \n          )\n        \n        \n          \n            )\n          \n        \n      \n    \n    {\\displaystyle F_{e}=\\rho _{e}{\\overrightarrow {E}}-{1 \\over 2}\\varepsilon _{0}{\\overrightarrow {E}}^{2}\\triangledown \\varepsilon _{r}+{1 \\over 2}\\varepsilon _{0}\\triangledown {\\Bigl (}{\\overrightarrow {E}}^{2}\\rho _{f}\\left({\\frac {\\partial \\varepsilon _{r}}{\\partial \\rho _{f}}}\\right){\\Bigr )}}\n  \n\nThis electrical force is then inserted in Navier-Stokes equation, as a body (volumetric) force.EHD covers the following types of particle and fluid transport mechanisms: electrophoresis, electrokinesis, dielectrophoresis, electro-osmosis, and electrorotation. In general, the phenomena relate to the direct conversion of electrical energy into kinetic energy, and vice versa.\nIn the first instance, shaped electrostatic fields (ESF's) create hydrostatic pressure (HSP, or motion) in dielectric media. When such media are fluids, a flow is produced. If the dielectric is a vacuum or a solid, no flow is produced. Such flow can be directed against the electrodes, generally to move the electrodes. In such case, the moving structure acts as an electric motor. Practical fields of interest of EHD are the common air ioniser, electrohydrodynamic thrusters and EHD cooling systems.\nIn the second instance, the converse takes place. A powered flow of medium within a shaped electrostatic field adds energy to the system which is picked up as a potential difference by electrodes. In such case, the structure acts as an electrical generator.\n\n",
    "intuition": "Intuition is the ability to acquire knowledge, without recourse to conscious reasoning or needing an explanation. Different fields use the word \"intuition\" in very different ways, including but not limited to: direct access to unconscious knowledge; unconscious cognition; gut feelings; inner sensing; inner insight to unconscious pattern-recognition; and the ability to understand something instinctively, without any need for conscious reasoning. Intuitive knowledge tends to be approximate.\nThe word intuition comes from the Latin verb intueri translated as \"consider\" or from the late middle English word intuit, \"to contemplate\". Use of intuition is sometimes referred to as responding to a \"gut feeling\" or \"trusting your gut\".\n\n",
    "drosophila": "Drosophila (), from Ancient Greek δρόσος (drósos), meaning \"dew\", and φίλος (phílos), meaning \"loving\", is a genus of fly, belonging to the family Drosophilidae, whose members are often called \"small fruit flies\" or pomace flies, vinegar flies, or wine flies, a reference to the characteristic of many species to linger around overripe or rotting fruit. They should not be confused with the Tephritidae, a related family, which are also called fruit flies (sometimes referred to as \"true fruit flies\"); tephritids feed primarily on unripe or ripe fruit, with many species being regarded as destructive agricultural pests, especially the Mediterranean fruit fly.\nOne species of Drosophila in particular, Drosophila melanogaster, has been heavily used in research in genetics and is a common model organism in developmental biology. The terms \"fruit fly\" and \"Drosophila\" are often used synonymously with D. melanogaster in modern biological literature. The entire genus, however, contains more than 1,500 species and is very diverse in appearance, behavior, and breeding habitat.",
    "sweptback": "A swept wing is a wing angled either backward or occasionally forward from its root rather than perpendicular to the fuselage.\nSwept wings have been flown since the pioneer days of aviation. Wing sweep at high speeds was first investigated in Germany as early as 1935 by Albert Betz and Adolph Busemann, finding application just before the end of the Second World War. It has the effect of delaying the shock waves and accompanying aerodynamic drag rise caused by fluid compressibility near the speed of sound, improving performance. Swept wings are therefore almost always used on jet aircraft designed to fly at these speeds.\nThe term \"swept wing\" is normally used to mean \"swept back\", but variants include forward sweep, variable sweep wings and oblique wings in which one side sweeps forward and the other back. The delta wing is also aerodynamically a form of swept wing.",
    "bypass": "Bypass may refer to:\n\nBypass (road), a road that avoids a built-up area (not to be confused with passing lane)\nFlood bypass of a river",
    "stage": "Stage, stages, or staging may refer to:",
    "reanalysis": "Reanalysis is a new analysis of something. It may refer to:\n\nReanalysis (linguistics) or folk etymology, change in a word or phrase resulting from the replacement of an unfamiliar form by a more familiar one\nRebracketing, a process where a word originally derived from one source is broken down into a different set of factors\nBack-formation, a process of creating a new word by removing actual or supposed affixes\nNew statistical analysis of a data set that has already been analyzed\nA repeat analysis, for example in chemistry",
    "dicsovering": null,
    "derivation": "Derivation may refer to:",
    "ascertained": "To be announced (TBA) is a placeholder term used very broadly in event planning to indicate that although something is scheduled or expected to happen, a particular aspect of it remains to be fixed or set. Other versions of the term include to be confirmed (TBC) and to be determined, discussed, defined, decided, declared, or done (TBD).",
    "redirecting": "Redirect and its variants (e.g., redirection) may refer to:",
    "define": "A definition is a statement of the meaning of a term (a word, phrase, or other set of symbols). Definitions can be classified into two large categories: intensional definitions (which try to give the sense of a term), and extensional definitions (which try to list the objects that a term describes). Another important category of definitions is the class of ostensive definitions, which convey the meaning of a term by pointing out examples. A term may have many different senses and multiple meanings, and thus require multiple definitions.\nIn mathematics, a definition is used to give a precise meaning to a new term, by describing a condition which unambiguously qualifies what the mathematical term is and is not. Definitions and axioms form the basis on which all of modern mathematics is to be constructed.",
    "induce": "Induce may refer to:\n\nInduced consumption\nInduced innovation\nInduced character\nInduced coma\nInduced menopause\nInduced metric\nInduced path\nInduced topology\nInduce (musician), American musician\nLabor induction, stimulation of childbirth\n\n",
    "dissertation": "A thesis (pl.: theses), or dissertation (abbreviated diss.), is a document submitted in support of candidature for an academic degree or professional qualification presenting the author's research and findings. In some contexts, the word thesis or a cognate is used for part of a bachelor's or master's course, while dissertation is normally applied to a doctorate. This is the typical arrangement in American English. In other contexts, such as within most institutions of the United Kingdom, South Africa, the Commonwealth Countries, and Brazil, the reverse is true. The term graduate thesis is sometimes used to refer to both master's theses and doctoral dissertations.\nThe required complexity or quality of research of a thesis or dissertation can vary by country, university, or program, and the required minimum study period may thus vary significantly in duration.\nThe word dissertation can at times be used to describe a treatise without relation to obtaining an academic degree. The term thesis is also used to refer to the general claim of an essay or similar work.",
    "appendix": "Appendix (pl.: appendices or appendixes) may refer to:",
    "1947": "1947 (MCMXLVII) was a common year starting on Wednesday of the Gregorian calendar, the 1947th year of the Common Era (CE) and Anno Domini (AD) designations, the 947th  year of the 2nd millennium, the 47th  year of the 20th century, and the  8th   year of the 1940s decade.  \nIt was the first year of the Cold War, which would last until 1991, ending with the dissolution of the Soviet Union.\n\n",
    "discontinuity": "Discontinuity may refer to:\n\nDiscontinuity (casting), an interruption in the normal physical structure or configuration of an article\nDiscontinuity (geotechnical engineering), a plane or surface marking a change in physical or chemical properties in a soil or rock mass\nDiscontinuity (mathematics), a property of a mathematical function\nDiscontinuity (linguistics), a property of tree structures in theoretical linguistics\nDiscontinuity (Postmodernism), a conception of history as espoused by the philosopher Michel Foucault.\nRevolutionary breach of legal continuity\nA break in continuity (fiction), in literature\nFracture (geology), discontinuity in rocks\nDiscontinuity (transmission lines), a step in impedance causing reflections",
    "0001": "The 0s began on January 1, AD 1 and ended on December 31, AD 9, covering the first nine years of the Common Era.\nIn Europe, the 0s saw the continuation of conflict between the Roman Empire and Germanic tribes in the Early Imperial campaigns in Germania. Vinicius, Tiberius and Varus led Roman forces in multiple punitive campaigns, before sustaining a major defeat at the hands of Arminius in the Battle of the Teutoburg Forest. Concurrently, the Roman Empire fought the Bellum Batonianum against a rebelling alliance of native peoples led by Bato the Daesitiate in Illyricum, which was suppressed in AD 9. A conflict also took place in Korea, where Daeso, King of Dongbuyeo invaded Goguryeo with a 50,000-man army in AD 6. He was forced to retreat when heavy snow began to fall, stopping the conflict until the next decade. In China, the last ruler of the Chinese Western Han dynasty (Ruzi Ying) was deposed, allowing Wang Mang to establish the Xin dynasty.\nLiterary works from the 0s include works from the ancient Roman poet Ovid; the Ars Amatoria, an instructional elegy series in three books, Metamorphoses, a poem which chronicles the history of the world from its creation to the deification of Julius Caesar within a loose mythico-historical framework, and Ibis, a curse poem written during his years in exile across the Black Sea for an offense against Augustus. Nicolaus of Damascus wrote the 15-volume History of the World.\nEstimates for the world population by AD 1 range from 170 to 300 million. A census was concluded in China in AD 2: final numbers showed a population of nearly 60 million (59,594,978 people in slightly more than 12 million households). The census is one of the most accurate surveys in Chinese history.",
    "11in": "The Marvel Comics oversized hardcover format launched in 2002, reproducing full-colour comics in books approximately 11in x 7.5in in size. This was roughly an inch taller and wider than the original comic book.",
    "agrees": "Agreement may refer to:"
}