{
    "aerodynamics": "Aerodynamics (Ancient Greek: ἀήρ aero (air) + Ancient Greek: δυναμική (dynamics)) is the study of the motion of air, particularly when affected by a solid object, such as an airplane wing. It involves topics covered in the field of fluid dynamics and its subfield of gas dynamics, and is an important domain of study in aeronautics. The term aerodynamics is often used synonymously with gas dynamics, the difference being that \"gas dynamics\" applies to the study of the motion of all gases, and is not limited to air. The formal study of aerodynamics began in the modern sense in the eighteenth century, although observations of fundamental concepts such as aerodynamic drag were recorded much earlier. Most of the early efforts in aerodynamics were directed toward achieving heavier-than-air flight, which was first demonstrated by Otto Lilienthal in 1891. Since then, the use of aerodynamics through mathematical analysis, empirical approximations, wind tunnel experimentation, and computer simulations has formed a rational basis for the development of heavier-than-air flight and a number of other technologies. Recent work in aerodynamics has focused on issues related to compressible flow, turbulence, and boundary layers and has become increasingly computational in nature.\n\n",
    "aerofoil": "An airfoil (American English) or aerofoil (British English) is a streamlined body that is capable of generating significantly more lift than drag. Wings, sails and propeller blades are examples of airfoils. Foils of similar function designed with water as the working fluid are called hydrofoils.\nWhen oriented at a suitable angle, a solid body moving through a fluid deflects the oncoming fluid (for fixed-wing aircraft, a downward force), resulting in a force on the airfoil in the direction opposite to the deflection. This force is known as aerodynamic force and can be resolved into two components: lift (perpendicular to the remote freestream velocity) and drag (parallel to the freestream velocity).\nThe lift on an airfoil is primarily the result of its angle of attack. Most foil shapes require a positive angle of attack to generate lift, but cambered airfoils can generate lift at zero angle of attack. Airfoils can be designed for use at different speeds by modifying their geometry: those for subsonic flight generally have a rounded leading edge, while those designed for supersonic flight tend to be slimmer with a sharp leading edge. All have a sharp trailing edge.\nThe air deflected by an airfoil causes it to generate a lower-pressure \"shadow\" above and behind itself. This pressure difference is accompanied by a velocity difference, via Bernoulli's principle, so the resulting flowfield about the airfoil has a higher average velocity on the upper surface than on the lower surface. In some situations (e.g., inviscid potential flow) the lift force can be related directly to the average top/bottom velocity difference without computing the pressure by using the concept of circulation and the Kutta–Joukowski theorem.\n\n",
    "slipstream": "A slipstream is a region behind a moving object in which a wake of fluid (typically air or water) is moving at velocities comparable to that of the moving object, relative to the ambient fluid through which the object is moving. The term slipstream also applies to the similar region adjacent to an object with a fluid moving around it. \"Slipstreaming\" or \"drafting\" works because of the relative motion of the fluid in the slipstream.\n\n",
    "unsteadiness": "Vertigo is a condition in which a person has the sensation that they are moving, or that objects around them are moving, when they are not. Often it feels like a spinning or swaying movement. It may be associated with nausea, vomiting, perspiration, or difficulties walking. It is typically worse when the head is moved. Vertigo is the most common type of dizziness.\nThe most common disorders that result in vertigo are benign paroxysmal positional vertigo (BPPV), Ménière's disease, and vestibular neuritis. Less common causes include stroke, brain tumors, brain injury, multiple sclerosis, migraines, trauma, and uneven pressures between the middle ears. Physiologic vertigo may occur following being exposed to motion for a prolonged period such as when on a ship or simply following spinning with the eyes closed. Other causes may include toxin exposures such as to carbon monoxide, alcohol, or aspirin. Vertigo typically indicates a problem in a part of the vestibular system. Other causes of dizziness include presyncope, disequilibrium, and non-specific dizziness.\nBenign paroxysmal positional vertigo is more likely in someone who gets repeated episodes of vertigo with movement and is otherwise normal between these episodes. Benign vertigo episodes generally last less than one minute. The Dix-Hallpike test typically produces a period of rapid eye movements known as nystagmus in this condition. In Ménière's disease there is often ringing in the ears, hearing loss, and the attacks of vertigo last more than twenty minutes. In vestibular neuritis the onset of vertigo is sudden, and the nystagmus occurs even when the person has not been moving. In this condition vertigo can last for days. More severe causes should also be considered, especially if other problems such as weakness, headache, double vision, or numbness occur.\nDizziness affects approximately 20–40% of people at some point in time, while about 7.5–10% have vertigo. About 5% have vertigo in a given year. It becomes more common with age and affects women two to three times more often than men. Vertigo accounts for about 2–3% of emergency department visits in the developed world.\n\n",
    "stokes": "The Navier–Stokes equations ( nav-YAY STOHKS) are partial differential equations which describe the motion of viscous fluid substances.  They were named after French engineer and physicist Claude-Louis Navier and the Irish physicist and mathematician George Gabriel Stokes.  They were developed over several decades of progressively building the theories, from 1822 (Navier) to 1842–1850 (Stokes).\nThe Navier–Stokes equations mathematically express momentum balance for Newtonian fluids and make use of conservation of mass. They are sometimes accompanied by an equation of state relating pressure, temperature  and density. They arise from applying Isaac Newton's second law to fluid motion, together with the assumption that the stress in the fluid is the sum of a diffusing viscous term (proportional to the gradient of velocity) and a pressure term—hence describing viscous flow. The difference between them and the closely related Euler equations is that Navier–Stokes equations take viscosity into account while the Euler equations model only inviscid flow. As a result, the Navier–Stokes are an elliptic equation and therefore have better analytic properties, at the expense of having less mathematical structure (e.g. they are never completely integrable).\nThe Navier–Stokes equations are useful because they describe the physics of many phenomena of scientific and engineering interest. They may be used to model the weather, ocean currents, water flow in a pipe and air flow around a wing. The Navier–Stokes equations, in their full and simplified forms, help with the design of aircraft and cars, the study of blood flow, the design of power stations, the analysis of pollution, and many other problems. Coupled with Maxwell's equations, they can be used to model and study magnetohydrodynamics.\nThe Navier–Stokes equations are also of great interest in a purely mathematical sense. Despite their wide range of practical uses, it has not yet been proven whether smooth solutions always exist in three dimensions—i.e., whether they are infinitely differentiable (or even just bounded) at all points in the domain. This is called the Navier–Stokes existence and smoothness problem. The Clay Mathematics Institute has called this one of the seven most important open problems in mathematics and has offered a US$1 million prize for a solution or a counterexample.\n\n",
    "viscoelasticity": "In materials science and continuum mechanics, viscoelasticity is the property of materials that exhibit both viscous and elastic characteristics when undergoing deformation. Viscous materials, like water, resist both shear flow and strain linearly with time when a stress is applied. Elastic materials strain when stretched and immediately return to their original state once the stress is removed.\nViscoelastic materials have elements of both of these properties and, as such, exhibit time-dependent strain. Whereas elasticity is usually the result of bond stretching along crystallographic planes in an ordered solid, viscosity is the result of the diffusion of atoms or molecules inside an amorphous material.\n\n",
    "shock": "Shock is the state of insufficient blood flow to the tissues of the body as a result of problems with the circulatory system. Initial symptoms of shock may include weakness, tachycardia, hyperventilation, sweating, anxiety, and increased thirst. This may be followed by confusion, unconsciousness, or cardiac arrest, as complications worsen.\nShock is divided into four main types based on the underlying cause: hypovolemic, cardiogenic, obstructive, and distributive shock. Hypovolemic shock, also known as low volume shock, may be from bleeding, diarrhea, or vomiting. Cardiogenic shock may be due to a heart attack or cardiac contusion. Obstructive shock may be due to cardiac tamponade or a tension pneumothorax. Distributive shock may be due to sepsis, anaphylaxis, injury to the upper spinal cord, or certain overdoses.\nThe diagnosis is generally based on a combination of symptoms, physical examination, and laboratory tests. A decreased pulse pressure (systolic blood pressure minus diastolic blood pressure) or a fast heart rate raises concerns.\nShock is a medical emergency and requires urgent medical care. If shock is suspected, emergency help should be called immediately. While waiting for medical care, the individual should be, if safe, laid down (except in cases of suspected head or back injuries). The legs should be raised if possible, and the person should be kept warm. If the person is unresponsive, breathing should be monitored and CPR may need to be performed.\n\n",
    "gust": "Guster is an American alternative rock band formed in Somerville, Massachusetts. Founding members Adam Gardner, Ryan Miller, and Brian Rosenworcel began practice sessions while attending Tufts University and formed the band in 1991. The members met during the freshman Wilderness Orientation program in August of that year, playing publicly together as a trio two months later at the Midnight Cafe coffee house set in the common area of the Lewis Hall dormitory. While attending Tufts, the band lived at 139 College Avenue in Somerville.\nThe band stayed \"underground\" for its first two full-length albums, Parachute (1994) and Goldfly (1997), but broke into the musical mainstream in 1999 with its third studio album Lost and Gone Forever, featuring the single \"Fa Fa\", which made it onto the Adult Top 40. The band enjoyed moderate success on the charts with Keep It Together, its fourth album, with two singles in the Adult Top 40 (\"Careful\" and \"Amsterdam\"). Joe Pisapia joined the official lineup for Keep It Together and its follow-up, Ganging Up on the Sun, which peaked at 25 on the Billboard 200. A variety of television shows and movies have featured the band's music, including Martian Child, which featured their song \"Satellite\"; Disturbia; Wedding Crashers; Life as a House, which makes several allusions to the band throughout the film; The O.C.; and one of the band's songs was used in an ad for The Weather Channel. The band earned its first gold record in 2018 for its single \"Satellite\".\nGuster's tours were originally local, but began to spread as the band gained popularity. In 1999, Guster gave its first performance in Canada, followed by a 2004 tour in Britain that had four shows in London and one in Manchester. Guster maintains a liberal taping policy and has a very dedicated and active taping community. In addition, the band has released several live shows via iTunes.",
    "drag": "A drag queen is a person, usually male,  who uses drag clothing and makeup to imitate and often exaggerate female gender signifiers and gender roles for entertainment purposes. Historically, drag queens have usually been gay men, and have been a part of gay culture.\nPeople do drag for reasons ranging from self-expression to mainstream performance. Drag shows frequently include lip-syncing, live singing, and dancing. They typically occur at LGBTQ pride parades, drag pageants, cabarets, carnivals, and nightclubs. Drag queens vary by type, culture, and dedication, from professionals who star in films and spend a lot of their time in their drag personas, to people who do drag only occasionally. Women who dress as men and entertain by imitating them are called drag kings.\nThose who do occasional drag may be from other backgrounds than the LGBT community. There is a long history of folkloric and theatrical crossdressing that involves people of all orientations. Not everyone who does drag at some point in their lives is a drag queen or a drag king.",
    "lifting": "A lifting gas or lighter-than-air gas is a gas that has a density lower than normal atmospheric gases and rises above them as a result, making it useful in lifting lighter-than-air aircraft. Only certain lighter-than-air gases are suitable as lifting gases. Dry air has a density of about 1.29 g/L (gram per liter) at standard conditions for temperature and pressure (STP) and an average molecular mass of 28.97 g/mol, and so lighter-than-air gases have a density lower than this.",
    "shear": "In materials science, shear modulus or modulus of rigidity, denoted by G, or sometimes S or μ, is a measure of the elastic shear stiffness of a material and is defined as the ratio of shear stress to the shear strain:\n\n  \n    \n      \n        G\n         \n        \n          \n            \n              \n                =\n              \n              \n                \n                  d\n                  e\n                  f\n                \n              \n            \n          \n        \n         \n        \n          \n            \n              τ\n              \n                x\n                y\n              \n            \n            \n              γ\n              \n                x\n                y\n              \n            \n          \n        \n        =\n        \n          \n            \n              F\n              \n                /\n              \n              A\n            \n            \n              Δ\n              x\n              \n                /\n              \n              l\n            \n          \n        \n        =\n        \n          \n            \n              F\n              l\n            \n            \n              A\n              Δ\n              x\n            \n          \n        \n      \n    \n    {\\displaystyle G\\ {\\stackrel {\\mathrm {def} }{=}}\\ {\\frac {\\tau _{xy}}{\\gamma _{xy}}}={\\frac {F/A}{\\Delta x/l}}={\\frac {Fl}{A\\Delta x}}}\n  \n\nwhere \n\n  \n    \n      \n        \n          τ\n          \n            x\n            y\n          \n        \n        =\n        F\n        \n          /\n        \n        A\n        \n      \n    \n    {\\displaystyle \\tau _{xy}=F/A\\,}\n  \n = shear stress\n\n  \n    \n      \n        F\n      \n    \n    {\\displaystyle F}\n  \n is the force which acts\n\n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n is the area on which the force acts\n\n  \n    \n      \n        \n          γ\n          \n            x\n            y\n          \n        \n      \n    \n    {\\displaystyle \\gamma _{xy}}\n  \n = shear strain. In engineering \n  \n    \n      \n        :=\n        Δ\n        x\n        \n          /\n        \n        l\n        =\n        tan\n        ⁡\n        θ\n      \n    \n    {\\displaystyle :=\\Delta x/l=\\tan \\theta }\n  \n, elsewhere \n  \n    \n      \n        :=\n        θ\n      \n    \n    {\\displaystyle :=\\theta }\n  \n\n  \n    \n      \n        Δ\n        x\n      \n    \n    {\\displaystyle \\Delta x}\n  \n is the transverse displacement\n\n  \n    \n      \n        l\n      \n    \n    {\\displaystyle l}\n  \n is the initial length of the area.\nThe derived SI unit of shear modulus is the pascal (Pa), although it is usually expressed in gigapascals (GPa) or in thousand pounds per square inch (ksi). Its dimensional form is M1L−1T−2, replacing force by mass times acceleration.",
    "velocity": "Velocity is a measurement of speed in a certain direction of motion. It is a fundamental concept in kinematics, the branch of classical mechanics that describes the motion of physical objects. Velocity is a vector quantity, meaning that both magnitude and direction are needed to define it. The scalar absolute value (magnitude) of velocity is called speed, being a coherent derived unit whose quantity is measured in the SI (metric system) as metres per second (m/s or m⋅s−1). For example, \"5 metres per second\" is a scalar, whereas \"5 metres per second east\" is a vector. If there is a change in speed, direction or both, then the object is said to be undergoing an acceleration.",
    "inlet": "An inlet is a (usually long and narrow) indentation of a shoreline, such as a small arm, cove, bay, sound, fjord, lagoon or marsh, that leads to an enclosed larger body of water such as a lake, estuary, gulf or marginal sea.",
    "viscid": "An earthworm is a soil-dwelling terrestrial invertebrate that belongs to the phylum Annelida. The term is the common name for the largest members of the class (or subclass, depending on the author) Oligochaeta. In classical systems, they were in the order of Opisthopora since the male pores opened posterior to the female pores, although the internal male segments are anterior to the female. Theoretical cladistic studies have placed them in the suborder Lumbricina of the order Haplotaxida, but this may change. Other slang names for earthworms include \"dew-worm\", \"rainworm\", \"nightcrawler\", and \"angleworm\" (from its use as angling hookbaits). Larger terrestrial earthworms are also called megadriles (which translates to \"big worms\") as opposed to the microdriles (\"small worms\") in the semiaquatic families Tubificidae, Lumbricidae and Enchytraeidae. The megadriles are characterized by a distinct clitellum (more extensive than that of microdriles) and a vascular system with true capillaries.\nEarthworms are commonly found in moist, compost-rich soil, eating a wide variety of organic matters, which include detritus, living protozoa, rotifers, nematodes, bacteria, fungi and other microorganisms. An earthworm's digestive system runs the length of its body. They are one of nature's most important detritivores and coprophages, and also serve as food for many low-level consumers within the ecosystems.\nEarthworms exhibit an externally segmented tube-within-a-tube body plan with corresponding internal segmentations, and usually have setae on all segments. They have a cosmopolitan distribution wherever soil, water and temperature conditions allow. They have a double transport system made of coelomic fluid that moves within the fluid-filled coelom and a simple, closed circulatory system, and respire (breathe) via cutaneous respiration. As soft-bodied invertebrates, they lack a true skeleton, but their structure is maintained by fluid-filled coelom chambers that function as a hydrostatic skeleton.\nEarthworms have a central nervous system consisting of two ganglia above the mouth, one on either side, connected to an axial nerve running along its length to motor neurons and sensory cells in each segment. Large numbers of chemoreceptors concentrate near its mouth. Circumferential and longitudinal muscles edging each segment let the worm move. Similar sets of muscles line the gut tube, and their actions propel digested food toward the worm's anus.\nEarthworms are hermaphrodites: each worm carries male and female reproductive organs and  genital pores. When mating, two individual earthworms will exchange sperm and fertilize each other's ova.\n\n",
    "flowmeter": "Flow measurement is the quantification of bulk fluid movement.  Flow can be measured using devices called flowmeters in various ways. The common types of flowmeters with industrial applications are listed below:\n\nObstruction type (differential pressure or variable area)\nInferential (turbine type)\nElectromagnetic\nPositive-displacement flowmeters, which accumulate a fixed volume of fluid and then count the number of times the volume is filled to measure flow.\nFluid dynamic (vortex shedding)\nAnemometer\nUltrasonic flow meter\nMass flow meter (Coriolis force).\nFlow measurement methods other than positive-displacement flowmeters rely on forces produced by the flowing stream as it overcomes a known constriction, to indirectly calculate flow. Flow may be measured by measuring the velocity of fluid over a known area. For very large flows, tracer methods may be used to deduce the flow rate from the change in concentration of a dye or radioisotope.",
    "deceleration": "In mechanics, acceleration is the rate of change of the velocity of an object with respect to time. Acceleration is one of several components of kinematics, the study of motion. Accelerations are vector quantities (in that they have magnitude and direction). The orientation of an object's acceleration is given by the orientation of the net force acting on that object. The magnitude of an object's acceleration, as described by Newton's second law, is the combined effect of two causes:\n\nthe net balance of all external forces acting onto that object — magnitude is directly proportional to this net resulting force;\nthat object's mass, depending on the materials out of which it is made — magnitude is inversely proportional to the object's mass.\nThe SI unit for acceleration is metre per second squared (m⋅s−2, \n  \n    \n      \n        \n          \n            \n              m\n              \n                s\n                \n                  2\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\mathrm {\\tfrac {m}{s^{2}}} }\n  \n).\nFor example, when a vehicle starts from a standstill (zero velocity, in an inertial frame of reference) and travels in a straight line at increasing speeds, it is accelerating in the direction of travel. If the vehicle turns, an acceleration occurs toward the new direction and changes its motion vector.  The acceleration of the vehicle in its current direction of motion is called a linear (or tangential during circular motions) acceleration, the reaction to which the passengers on board experience as a force pushing them back into their seats. When changing direction, the effecting acceleration is called radial (or centripetal during circular motions) acceleration, the reaction to which the passengers experience as a centrifugal force. If the speed of the vehicle decreases, this is an acceleration in the opposite direction of the velocity vector (mathematically a negative, if the movement is unidimensional and the velocity is positive), sometimes called deceleration or retardation, and passengers experience the reaction to deceleration as an inertial force pushing them forward.  Such negative accelerations are often achieved by retrorocket burning in spacecraft. Both acceleration and deceleration are treated the same, as they are both changes in velocity. Each of these accelerations (tangential, radial, deceleration) is felt by passengers until their relative (differential) velocity are neutralised in reference to the acceleration due to change in speed.\n\n",
    "deflection": "A deflection yoke is a kind of magnetic lens, used in cathode ray tubes to scan the electron beam both vertically and horizontally over the whole screen.\nIn a CRT television, the electron beam is moved in a raster scan on the screen. By adjusting the strength of the beam current, the brightness of the light produced by the phosphor on the screen can be varied.  The cathode ray tube allowed the development of all-electronic television.\nElectromagnetic deflection yokes are also used in certain radar displays.",
    "transient": "ECHELON, originally a secret government code name, is a surveillance program (signals intelligence/SIGINT collection and analysis network) operated by the five signatory states to the UKUSA Security Agreement: Australia, Canada, New Zealand, the United Kingdom and the United States, also known as the Five Eyes.\nCreated in the late 1960s to monitor the military and diplomatic communications of the Soviet Union and its Eastern Bloc allies during the Cold War, the ECHELON project became formally established in 1971. By the end of the 20th century, it had greatly expanded.",
    "streamlining": "A streamliner is a vehicle incorporating streamlining in a shape providing reduced air resistance. The term is applied to high-speed railway trainsets of the 1930s to 1950s, and to their successor \"bullet trains\". Less commonly, the term is applied to fully faired upright and recumbent bicycles. As part of the Streamline Moderne trend, the term was applied to passenger cars, trucks, and other types of light-, medium-, or heavy-duty vehicles, but now vehicle streamlining is so prevalent that it is not an outstanding characteristic. In land speed racing, it is a term applied to the long, slender, custom built, high-speed vehicles with enclosed wheels.",
    "ballistic": "A ballistic missile is a type of missile that uses projectile motion to deliver warheads on a target. These weapons are powered only during relatively brief periods—most of the flight is unpowered. Short-range ballistic missiles (SRBM) typically stay within the Earth's atmosphere, while most larger missiles travel outside the atmosphere. The type of ballistic missile with the greatest range is an intercontinental ballistic missile (ICBM). The largest ICBMs are capable of full orbital flight.\nThese missiles are in a distinct category from cruise missiles, which are aerodynamically guided in powered flight and thus restricted to the atmosphere.",
    "freestream": "The freestream is the air far upstream of an aerodynamic body, that is, before the body has a chance to deflect, slow down or compress the air. Freestream conditions are usually denoted with a \n  \n    \n      \n        ∞\n      \n    \n    {\\displaystyle \\infty }\n  \n symbol, e.g. \n  \n    \n      \n        \n          V\n          \n            ∞\n          \n        \n      \n    \n    {\\displaystyle V_{\\infty }}\n  \n, meaning the freestream velocity.\n\n",
    "tailplane": "A tailplane, also known as a horizontal stabilizer, is a small lifting surface located on the tail (empennage) behind the main lifting surfaces of a fixed-wing aircraft as well as other non-fixed-wing aircraft such as helicopters and gyroplanes. Not all fixed-wing aircraft have tailplanes. Canards, tailless and flying wing aircraft have no separate tailplane, while in V-tail aircraft the vertical stabilizer, rudder, and the tail-plane and elevator are combined to form two diagonal surfaces in a V layout.\nThe function of the tailplane is to provide stability and control. In particular, the tailplane helps adjust for changes in position of the centre of pressure or centre of gravity caused by changes in speed and attitude, fuel consumption, or dropping cargo or payload.\n\n",
    "hydroballistic": "The Mk44 Bushmaster II is a 30 mm chain gun manufactured by Northrop Grumman.  It is a derivative of the 25 mm M242 Bushmaster, and uses 70% of the same parts as the M242 while increasing the firepower by as much as 50% with the 20% increase in caliber size. The barrel is chromium-plated for extended life. The gun uses standard GAU-8 Avenger ammunition that is available in API (Armor-Piercing Incendiary), HEI (High-Explosive Incendiary) and APFSDS-T (Armor-Piercing Fin-Stabilized Discarding Sabot-Tracer) variants.\nThe gun can be converted to a caliber of 40×180 mm, which involves changing the barrel and a few key parts, to use the SuperShot 40 cartridge. It can also be converted to use the 30×170 mm RARDEN cartridge.",
    "wavy": "WAVY-TV (channel 10) is a television station licensed to Portsmouth, Virginia, United States, serving the Hampton Roads area as an affiliate of NBC. It is owned by Nexstar Media Group alongside Virginia Beach–licensed dual Fox affiliate/CW owned-and-operated station WVBT (channel 43). The two stations share studios on Wavy Street in downtown Portsmouth; WAVY-TV's transmitter is located in Suffolk, Virginia.",
    "crossflow": "The Ford Kent is an internal combustion engine from Ford of Europe. Originally developed in 1959 for the Ford Anglia, it is an in-line four-cylinder overhead valve (OHV) pushrod engine with a cast-iron cylinder head and block.\nThe Kent family can be divided into three basic sub-families; the original pre-Crossflow Kent, the Crossflow (the most prolific of all versions of the Kent), and the transverse mounted Valencia.\nThe arrival of the Duratec-E engine in the fifth generation Fiesta range in 2002 signalled the end of the engine's use in production vehicles after a 44-year career, although the Valencia derivative remained in limited production in Brazil, as an industrial use engine by Ford's Power Products division, where it is known as the VSG-411 and VSG-413. Since 2010, it has been actively produced in the United States factories for Formula Ford globally because of its popularity in motorsport.\n\n",
    "muffler": "A muffler (North American and Australian English) or silencer (British English) is a device for reducing the noise emitted by the exhaust of an internal combustion engine—especially a noise-deadening device forming part of the exhaust system of an automobile.\n\n",
    "fin": "A fin is a thin component or appendage attached to a larger body or structure. Fins typically function as foils that produce lift or thrust, or provide the ability to steer or stabilize motion while traveling in water, air, or other fluids. Fins are also used to increase surface areas for heat transfer purposes, or simply as ornamentation.\nFins first evolved on fish as a means of locomotion. Fish fins are used to generate thrust and control the subsequent motion. Fish and other aquatic animals, such as cetaceans, actively propel and steer themselves with pectoral and tail fins. As they swim, they use other fins, such as dorsal and anal fins, to achieve stability and refine their maneuvering.\nThe fins on the tails of cetaceans, ichthyosaurs, metriorhynchids, mosasaurs and plesiosaurs are called flukes.\n\n",
    "mechanism": "The Antikythera mechanism ( AN-tik-ih-THEER-ə, US also  AN-ty-kih-) is an Ancient Greek hand-powered orrery (model of the Solar System). It is the oldest known example of an analogue computer. It could be used to predict astronomical positions and eclipses decades in advance. It could also be used to track the four-year cycle of athletic games similar to an Olympiad, the cycle of the ancient Olympic Games.\nThe artefact was among wreckage retrieved from a shipwreck off the coast of the Greek island Antikythera in 1901. In 1902, it was identified by archaeologist Valerios Stais as containing a gear. The device, housed in the remains of a wooden-framed case of (uncertain) overall size 34 cm × 18 cm × 9 cm (13.4 in × 7.1 in × 3.5 in), was found as one lump, later separated into three main fragments which are now divided into 82 separate fragments after conservation efforts. Four of these fragments contain gears, while inscriptions are found on many others. The largest gear is about 13 cm (5 in) in diameter and originally had 223 teeth. All these fragments of the mechanism are kept at the National Archaeological Museum, Athens, along with reconstructions and replicas, to demonstrate how it may have looked and worked.\nIn 2005, a team from Cardiff University led by Mike Edmunds used computer X-ray tomography and high resolution scanning to image inside fragments of the crust-encased mechanism and read the faintest inscriptions that once covered the outer casing. These scans suggest that the mechanism had 37 meshing bronze gears enabling it to follow the movements of the Moon and the Sun through the zodiac, to predict eclipses and to model the irregular orbit of the Moon, where the Moon's velocity is higher in its perigee than in its apogee. This motion was studied in the 2nd century BC by astronomer Hipparchus of Rhodes, and he may have been consulted in the machine's construction. There is speculation that a portion of the mechanism is missing and it calculated the positions of the five classical planets. The inscriptions were further deciphered in 2016, revealing numbers connected with the synodic cycles of Venus and Saturn.\nThe instrument is believed to have been designed and constructed by Hellenistic scientists and been variously dated to about 87 BC, between 150 and 100 BC, or 205 BC. It must have been constructed before the shipwreck, which has been dated by multiple lines of evidence to approximately 70–60 BC. In 2022, researchers proposed its initial calibration date, not construction date, could have been 23 December 178 BC. Other experts propose 204 BC as a more likely calibration date. Machines with similar complexity did not appear again until the 14th century in western Europe.\n\n",
    "galerkin": "In mathematics, in the area of numerical analysis, Galerkin methods are a family of methods for converting a continuous operator problem, such as a differential equation, commonly in a weak formulation, to a discrete problem by applying linear constraints determined by finite sets of basis functions. They are named after the Soviet mathematician Boris Galerkin.\nOften when referring to a Galerkin method, one also gives the name along with typical assumptions and approximation methods used:\n\nRitz–Galerkin method (after Walther Ritz) typically assumes symmetric and positive definite bilinear form in the weak formulation, where the differential equation for a physical system can be formulated via minimization of a quadratic function representing the system energy and the approximate solution is a linear combination of the given set of the basis functions.\nBubnov–Galerkin method (after Ivan Bubnov) does not require the bilinear form to be symmetric and substitutes the energy minimization with orthogonality constraints determined by the same basis functions that are used to approximate the solution. In an operator formulation of the differential equation, Bubnov–Galerkin method can be viewed as applying an orthogonal projection to the operator.\nPetrov–Galerkin method (after Georgii I. Petrov) allows using basis functions for orthogonality constraints (called test basis functions) that are different from the basis functions used to approximate the solution. Petrov–Galerkin method can be viewed as an extension of Bubnov–Galerkin method, applying a projection that is not necessarily orthogonal in the operator formulation of the differential equation.\nExamples of Galerkin methods are:\n\nthe Galerkin method of weighted residuals, the most common method of calculating the global stiffness matrix in the finite element method,\nthe boundary element method for solving integral equations,\nKrylov subspace methods.",
    "slope": "In mathematics, the slope or gradient of a line is a number that describes the direction of the line on a plane. Often denoted by the letter m, slope is calculated as the ratio of the vertical change to the horizontal change (\"rise over run\") between two distinct points on the line, giving the same number for any choice of points. \nThe line may be physical – as set by a road surveyor, pictorial as in a diagram of a road or roof, or abstract.\nAn application of the mathematical concept is found in the grade or gradient in geography and civil engineering. \nThe steepness, incline, or grade of a line is the absolute value of its slope: greater absolute value indicates a steeper line. The line trend is defined as follows: \n\nAn \"increasing\" or \"ascending\" line goes up from left to right and has positive slope: \n  \n    \n      \n        m\n        >\n        0\n      \n    \n    {\\displaystyle m>0}\n  \n.\nA \"decreasing\" or \"descending\" line goes down from left to right and has negative slope: \n  \n    \n      \n        m\n        <\n        0\n      \n    \n    {\\displaystyle m<0}\n  \n.\nSpecial directions are:\n\nA \"(square) diagonal\" line has unit slope: \n  \n    \n      \n        m\n        =\n        1\n      \n    \n    {\\displaystyle m=1}\n  \n\nA \"horizontal\" line (the graph of a constant function) has zero slope: \n  \n    \n      \n        m\n        =\n        0\n      \n    \n    {\\displaystyle m=0}\n  \n.\nA \"vertical\" line has undefined or infinite slope (see below).\nIf two points of a road have altitudes y1 and y2, the rise is the difference (y2 − y1) = Δy. Neglecting the Earth's curvature, if the two points have horizontal distance x1 and x2 from a fixed point, the run is (x2 − x1) = Δx. The slope between the two points is the difference ratio:\n\n  \n    \n      \n        m\n        =\n        \n          \n            \n              Δ\n              y\n            \n            \n              Δ\n              x\n            \n          \n        \n        =\n        \n          \n            \n              \n                y\n                \n                  2\n                \n              \n              −\n              \n                y\n                \n                  1\n                \n              \n            \n            \n              \n                x\n                \n                  2\n                \n              \n              −\n              \n                x\n                \n                  1\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle m={\\frac {\\Delta y}{\\Delta x}}={\\frac {y_{2}-y_{1}}{x_{2}-x_{1}}}.}\n  \n\nThrough trigonometry, the slope m of a line is related to its angle of inclination θ by the tangent function\n\n  \n    \n      \n        m\n        =\n        tan\n        ⁡\n        (\n        θ\n        )\n        .\n      \n    \n    {\\displaystyle m=\\tan(\\theta ).}\n  \n\nThus, a 45° rising line has slope m = +1, and a 45° falling line has slope m = −1.\nGeneralizing this, differential calculus defines the slope of a plane curve at a point as the slope of its tangent line at that point. When the curve is approximated by a series of points, the slope of the curve may be approximated by the slope of the secant line between two nearby points. When the curve is given as the graph of an algebraic expression, calculus gives formulas for the slope at each point. Slope is thus one of the central ideas of calculus and its applications to design.\n\n",
    "displacement": "Forced displacement (also forced migration or forced relocation) is an involuntary or coerced movement of a person or people away from their home or home region. The UNHCR defines 'forced displacement' as follows: displaced \"as a result of persecution, conflict, generalized violence or human rights violations\".\nA forcibly displaced person may also be referred to as a \"forced migrant\", a \"displaced person\" (DP), or, if displaced within the home country, an \"internally displaced person\" (IDP). While some displaced persons may be considered refugees, the latter term specifically refers to such displaced persons who are receiving legally-defined protection and are recognized as such by their country of residence and/or international organizations.\n\nForced displacement has gained attention in international discussions and policy making since the European migrant crisis. This has since resulted in a greater consideration of the impacts of forced migration on affected regions outside Europe. Various international, regional, and local organizations are developing and implementing approaches to both prevent and mitigate the impact of forced migration in the home regions as well as the receiving or destination regions. Additionally, some collaboration efforts are made to gather evidence in order to seek prosecution of those involved in causing events of human-made forced migration. An estimated 100 million people around the world were forcibly displaced by the end of 2022, with the majority coming from the Global South.\n\n",
    "cavitation": "Cavitation in fluid mechanics and engineering normally is the phenomenon in which the static pressure of a liquid reduces to below the liquid's vapor pressure, leading to the formation of small vapor-filled cavities in the liquid. When subjected to higher pressure, these cavities, called \"bubbles\" or \"voids\", collapse and can generate shock waves that may damage machinery. These shock waves are strong when they are very close to the imploded bubble, but rapidly weaken as they propagate away from the implosion. Cavitation is a significant cause of wear in some engineering contexts. Collapsing voids that implode near to a metal surface cause cyclic stress through repeated implosion. This results in surface fatigue of the metal, causing a type of wear also called \"cavitation\". The most common examples of this kind of wear are to pump impellers, and bends where a sudden change in the direction of liquid occurs. \nCavitation is usually divided into two classes of behavior. Inertial (or transient) cavitation is the process in which a void or bubble in a liquid rapidly collapses, producing a shock wave. It occurs in nature in the strikes of mantis shrimp and pistol shrimp, as well as in the vascular tissues of plants. In manufactured objects, it can occur in control valves, pumps, propellers and impellers.\nNon-inertial cavitation is the process in which a bubble in a fluid is forced to oscillate in size or shape due to some form of energy input, such as an acoustic field. The gas in the bubble may contain a portion of a different gas than the vapor phase of the liquid. Such cavitation is often employed in ultrasonic cleaning baths and can also be observed in pumps, propellers, etc.\nSince the shock waves formed by collapse of the voids are strong enough to cause significant damage to parts, cavitation is typically an undesirable phenomenon in machinery. It may be desirable if intentionally used, for example, to sterilize contaminated surgical instruments, break down pollutants in water purification systems, emulsify tissue for cataract surgery or kidney stone lithotripsy, or homogenize fluids. It is very often specifically prevented in the design of machines such as turbines or propellers, and eliminating cavitation is a major field in the study of fluid dynamics. However, it is sometimes useful and does not cause damage when the bubbles collapse away from machinery, such as in supercavitation.",
    "diaphragm": "The thoracic diaphragm, or simply the diaphragm (; Ancient Greek: διάφραγμα, romanized: diáphragma, lit. 'partition'), is a sheet of internal skeletal muscle in humans and other mammals that extends across the bottom of the thoracic cavity. The diaphragm is the most important muscle of respiration, and separates the thoracic cavity, containing the heart and lungs, from the abdominal cavity: as the diaphragm contracts, the volume of the thoracic cavity increases, creating a negative pressure there, which draws air into the lungs. Its high oxygen consumption is noted by the many mitochondria and capillaries present; more than in any other skeletal muscle.\nThe term diaphragm in anatomy, created by Gerard of Cremona, can refer to other flat structures such as the urogenital diaphragm or pelvic diaphragm, but \"the diaphragm\" generally refers to the thoracic diaphragm. In humans, the diaphragm is slightly asymmetric—its right half is higher up (superior) to the left half, since the large liver rests beneath the right half of the diaphragm. There is also speculation that the diaphragm is lower on the other side due to heart's presence.\nOther mammals have diaphragms, and other vertebrates such as amphibians and reptiles have diaphragm-like structures, but important details of the anatomy may vary, such as the position of the lungs in the thoracic cavity.",
    "lubrication": "Lubrication is the process or technique of using a lubricant to reduce friction and wear and tear in a contact between two surfaces. The study of lubrication is a discipline in the field of tribology.\nLubrication mechanisms such as fluid-lubricated systems are designed so that the applied load is partially or completely carried by hydrodynamic or hydrostatic pressure, which reduces solid body interactions (and consequently friction and wear). Depending on the degree of surface separation, different lubrication regimes can be distinguished.\nAdequate lubrication allows smooth, continuous operation of machine elements, reduces the rate of wear, and prevents excessive stresses or seizures at bearings. By repelling water and other substances, it also reduces corrosion. When lubrication breaks down, components can rub destructively against each other, causing heat, local welding, destructive damage and failure.",
    "laplace": "Pierre-Simon, Marquis de Laplace (; French: [pjɛʁ simɔ̃ laplas]; 23 March 1749 – 5 March 1827) was a French polymath, a scholar whose work has been instrumental in the fields of physics, astronomy, mathematics,  engineering, statistics, and philosophy. He summarized and extended the work of his predecessors in his five-volume Mécanique céleste (Celestial Mechanics) (1799–1825). This work translated the geometric study of classical mechanics to one based on calculus, opening up a broader range of problems. Laplace also popularized and further confirmed Sir Isaac Newton's work. In statistics, the Bayesian interpretation of probability was developed mainly by Laplace.\nLaplace formulated Laplace's equation, and pioneered the Laplace transform which appears in many branches of mathematical physics, a field that he took a leading role in forming. The Laplacian differential operator, widely used in mathematics, is also named after him. He restated and developed the nebular hypothesis of the origin of the Solar System and was one of the first scientists to suggest an idea similar to that of a black hole, with Stephen Hawking stating that \"Laplace essentially predicted the existence of black holes\". He originated Laplace's demon, which is a hypothetical all-predicting intellect. He also refined Newton's calculation of the speed of sound to derive a more accurate measurement.\nLaplace is regarded as one of the greatest scientists of all time. Sometimes referred to as the French Newton or Newton of France, he has been described as possessing a phenomenal natural mathematical faculty superior to that of almost all of his contemporaries. He was Napoleon's examiner when Napoleon graduated from the École Militaire in Paris in 1785.  Laplace became a count of the Empire in 1806 and was named a marquis in 1817, after the Bourbon Restoration.",
    "bulkhead": "A bulkhead is an upright wall within the hull of a ship, within the fuselage of an airplane, or a car.  Other kinds of partition elements within a ship are decks and deckheads.",
    "navier": "The Navier–Stokes equations ( nav-YAY STOHKS) are partial differential equations which describe the motion of viscous fluid substances.  They were named after French engineer and physicist Claude-Louis Navier and the Irish physicist and mathematician George Gabriel Stokes.  They were developed over several decades of progressively building the theories, from 1822 (Navier) to 1842–1850 (Stokes).\nThe Navier–Stokes equations mathematically express momentum balance for Newtonian fluids and make use of conservation of mass. They are sometimes accompanied by an equation of state relating pressure, temperature  and density. They arise from applying Isaac Newton's second law to fluid motion, together with the assumption that the stress in the fluid is the sum of a diffusing viscous term (proportional to the gradient of velocity) and a pressure term—hence describing viscous flow. The difference between them and the closely related Euler equations is that Navier–Stokes equations take viscosity into account while the Euler equations model only inviscid flow. As a result, the Navier–Stokes are an elliptic equation and therefore have better analytic properties, at the expense of having less mathematical structure (e.g. they are never completely integrable).\nThe Navier–Stokes equations are useful because they describe the physics of many phenomena of scientific and engineering interest. They may be used to model the weather, ocean currents, water flow in a pipe and air flow around a wing. The Navier–Stokes equations, in their full and simplified forms, help with the design of aircraft and cars, the study of blood flow, the design of power stations, the analysis of pollution, and many other problems. Coupled with Maxwell's equations, they can be used to model and study magnetohydrodynamics.\nThe Navier–Stokes equations are also of great interest in a purely mathematical sense. Despite their wide range of practical uses, it has not yet been proven whether smooth solutions always exist in three dimensions—i.e., whether they are infinitely differentiable (or even just bounded) at all points in the domain. This is called the Navier–Stokes existence and smoothness problem. The Clay Mathematics Institute has called this one of the seven most important open problems in mathematics and has offered a US$1 million prize for a solution or a counterexample.\n\n",
    "erosion": "Erosion is the action of surface processes (such as water flow or wind) that removes soil, rock, or dissolved material from one location on the Earth's crust and then transports it to another location where it is deposited. Erosion is distinct from weathering which involves no movement. Removal of rock or soil as clastic sediment is referred to as physical or mechanical erosion; this contrasts with chemical erosion, where soil or rock material is removed from an area by dissolution. Eroded sediment or solutes may be transported just a few millimetres, or for thousands of kilometres.\nAgents of erosion include rainfall; bedrock wear in rivers; coastal erosion by the sea and waves; glacial plucking, abrasion, and scour; areal flooding; wind abrasion; groundwater processes; and mass movement processes in steep landscapes like landslides and debris flows. The rates at which such processes act control how fast a surface is eroded. Typically, physical erosion proceeds the fastest on steeply sloping surfaces, and rates may also be sensitive to some climatically controlled properties including amounts of water supplied (e.g., by rain), storminess, wind speed, wave fetch, or atmospheric temperature (especially for some ice-related processes). Feedbacks are also possible between rates of erosion and the amount of eroded material that is already carried by, for example, a river or glacier. The transport of eroded materials from their original location is followed by deposition, which is arrival and emplacement of material at a new location.\nWhile erosion is a natural process, human activities have increased by 10–40 times the rate at which soil erosion is occurring globally. At agriculture sites in the Appalachian Mountains, intensive farming practices have caused erosion at up to 100 times the natural rate of erosion in the region. Excessive (or accelerated) erosion causes both \"on-site\" and \"off-site\" problems. On-site impacts include decreases in agricultural productivity and (on natural landscapes) ecological collapse, both because of loss of the nutrient-rich upper soil layers. In some cases, this leads to desertification. Off-site effects include sedimentation of waterways and eutrophication of water bodies, as well as sediment-related damage to roads and houses. Water and wind erosion are the two primary causes of land degradation; combined, they are responsible for about 84% of the global extent of degraded land, making excessive erosion one of the most significant environmental problems worldwide.: 2 : 1 \nIntensive agriculture, deforestation, roads, anthropogenic climate change and urban sprawl are amongst the most significant human activities in regard to their effect on stimulating erosion. However, there are many prevention and remediation practices that can curtail or limit erosion of vulnerable soils.\n\n",
    "subsonically": "Subsonic ammunition is ammunition designed to operate at velocities below the speed of sound (Mach 1), which at standard conditions is 340.29 m/s (1,116.4 ft/s). This avoids the supersonic shockwave or \"crack\" of a supersonic bullet, which, particularly for suppressed firearms, influences the loudness of the shot.\nSubsonic ammunition usually uses heavier bullets to retain as much kinetic energy as possible at the lower velocities.  Some subsonic ammunition is used in non-suppressed firearms to gain the advantages of heavier bullet weights.",
    "layer": "The Layer by Layer method, also known as the beginners' method, is a method of solving the 3x3x3 Rubik's Cube. Many beginners' methods use this approach, and it also forms the basis of the CFOP speedcubing technique.",
    "transmission": "A manual transmission (MT), also known as manual gearbox, standard transmission (in Canada, the United Kingdom and the United States), or stick shift (in the United States), is a multi-speed motor vehicle transmission system where gear changes require the driver to manually select the gears by operating a gear stick and clutch (which is usually a foot pedal for cars or a hand lever for motorcycles).\nEarly automobiles used sliding-mesh manual transmissions with up to three forward gear ratios. Since the 1950s, constant-mesh manual transmissions have become increasingly commonplace, and the number of forward ratios has increased to 5-speed and 6-speed manual transmissions for current vehicles.\nThe alternative to a manual transmission is an automatic transmission. Common types of automatic transmissions are the hydraulic automatic transmission (AT) and the continuously variable transmission (CVT). The automated manual transmission (AMT) and dual-clutch transmission (DCT) are internally similar to a conventional manual transmission, but are shifted automatically.\nAlternatively, there are semi-automatic transmissions. These systems are based on the design of, and are technically similar to, a conventional manual transmission. They have a gear shifter which requires the driver's input to manually change gears, but the driver is not required to engage a clutch pedal before changing gear. Instead, the mechanical linkage for the clutch pedal is replaced by an actuator, servo, or solenoid and sensors, which operate the clutch system automatically when the driver touches or moves the gearshift. This removes the need for a physical clutch pedal.\n\n",
    "ejector": "A vacuum ejector, or simply ejector, or aspirator, is a type of vacuum pump, which produces vacuum by means of the Venturi effect.\nIn an ejector, a working fluid (liquid or gaseous) flows through a jet nozzle into a tube that first narrows and then expands in cross-sectional area. The fluid leaving the jet is flowing at a high velocity which due to Bernoulli's principle results in it having low pressure, thus generating a vacuum. The outer tube then narrows into a mixing section where the high velocity working fluid mixes with the fluid that is drawn in by the vacuum, imparting enough velocity for it to be ejected, the tube then typically expands in order to decrease the velocity of the ejected stream, allowing the pressure to smoothly increase to the external pressure.\nThe strength of the vacuum produced depends on the velocity and shape of the fluid jet and the shape of the constriction and mixing sections, but if a liquid is used as the working fluid, the strength of the vacuum produced is limited by the vapor pressure of the liquid (for water, 3.2 kPa or 0.46 psi or 32 mbar at 25 °C or 77 °F).  If a gas is used, however, this restriction does not exist.\nIf not considering the source of the working fluid, vacuum ejectors can be significantly more compact than a self-powered vacuum pump of the same capacity.\n\n",
    "illustrating": "An illustration is a decoration, interpretation, or visual explanation of a text, concept, or process, designed for integration in print and digitally published media, such as posters, flyers, magazines, books, teaching materials, animations, video games and films. An illustration is typically created by an illustrator. Digital illustrations are often used to make websites and apps more user-friendly, such as the use of emojis to accompany digital type. Illustration also means providing an example; either in writing or in picture form.\nThe origin of the word \"illustration\" is late Middle English (in the sense ‘illumination; spiritual or intellectual enlightenment’): via Old French from Latin illustratio(n-), from the verb illustrare.\n\n",
    "timoshenko": "Semyon Konstantinovich Timoshenko (Russian: Семён Константинович Тимошенко; Ukrainian: Семен Костянтинович Тимошенко, romanized: Semen Kostyantynovych Tymoshenko; 18 February [O.S. 6 February] 1895 – 31 March 1970) was a Soviet military commander, Marshal of the Soviet Union, and one of the most prominent Red Army commanders during the Second World War.\nBorn to a Ukrainian family in Bessarabia, Timoshenko was drafted into the Imperial Russian Army and saw action in the First World War as a cavalryman. On the outbreak of the Russian Revolution he joined the Red Army. He served with distinction during the Russian Civil War and the subsequent Polish–Soviet War, which brought him into Vladimir Lenin's and Joseph Stalin's favour. Rapidly rising through the ranks, Timoshenko held several regional commands throughout the 1930s and survived the Great Purge. He led the Ukrainian Front during the Soviet invasion of Poland in 1939. In early 1940, Timoshenko took over the command of the Winter War in Finland from Kliment Voroshilov and turned the tide for the Soviets. In May 1940, he was named a Marshal of the Soviet Union and the People's Commissar for Defence. In the latter capacity, he took steps to modernise the Red Army and prepare for a likely war with Nazi Germany.\nOn the outbreak of the German invasion of the Soviet Union, Timoshenko was named chairman of the Stavka. Replaced by Stalin himself a month later, he went on to hold a series of important commands in the following year. In late 1941, he organised a major counter-offensive in Rostov, which brought him international renown. His fortunes had faltered by mid-1942, in particular after the overwhelming Soviet defeat at the Second Battle of Kharkov, and he was relieved from the command of the newly formed Stalingrad Front. He was recalled later that year and appointed commander of the Northwestern Front, and as a Stavka representative he oversaw and coordinated the activities of several fronts in various times during the last phase of the war, including the Leningrad, Volkhov, and North Caucasus Fronts and the Black Sea Fleet, and the 2nd and 3rd Ukrainian fronts.\nAfter the war, Timoshenko held commands in several Soviet military districts until his effective retirement in 1960. He died in 1970 at the age of 75.\n\n",
    "vector": "Vector graphics are a form of computer graphics in which visual images are created directly from geometric shapes defined on a Cartesian plane, such as points, lines, curves and polygons. The associated mechanisms may include vector display and printing hardware, vector data models and file formats, as well as the software based on these data models (especially graphic design software, computer-aided design, and geographic information systems). Vector graphics are an alternative to raster or bitmap graphics, with each having advantages and disadvantages in specific situations.\nWhile vector hardware has largely disappeared in favor of raster-based monitors and printers, vector data and software continue to be widely used, especially when a high degree of geometric precision is required, and when complex information can be decomposed into simple geometric primitives. Thus, it is the preferred model for domains such as engineering, architecture, surveying, 3D rendering, and typography, but is entirely inappropriate for applications such as photography and remote sensing, where raster is more effective and efficient. Some application domains, such as geographic information systems (GIS) and graphic design, use both vector and raster graphics at times, depending on purpose.\nVector graphics are based on the mathematics of analytic or coordinate geometry, and is not related to other mathematical uses of the term vector. This can lead to some confusion in disciplines in which both meanings are used.",
    "characteristic": "In mathematics, the term \"characteristic function\" can refer to any of several distinct concepts:\n\nThe indicator function of a subset, that is the function \n  \n    \n      \n        \n          \n            1\n          \n          \n            A\n          \n        \n        :\n        X\n        →\n        {\n        0\n        ,\n        1\n        }\n        ,\n      \n    \n    {\\displaystyle \\mathbf {1} _{A}\\colon X\\to \\{0,1\\},}\n  \n which for a given subset A of X, has value 1 at points of A and 0 at points of X − A.\nThe characteristic function in convex analysis, closely related to the indicator function of a set: \n  \n    \n      \n        \n          χ\n          \n            A\n          \n        \n        (\n        x\n        )\n        :=\n        \n          \n            {\n            \n              \n                \n                  0\n                  ,\n                \n                \n                  x\n                  ∈\n                  A\n                  ;\n                \n              \n              \n                \n                  +\n                  ∞\n                  ,\n                \n                \n                  x\n                  ∉\n                  A\n                  .\n                \n              \n            \n            \n          \n        \n      \n    \n    {\\displaystyle \\chi _{A}(x):={\\begin{cases}0,&x\\in A;\\\\+\\infty ,&x\\not \\in A.\\end{cases}}}\n  \n\nIn probability theory, the characteristic function of any probability distribution on the real line is given by the following formula, where X is any random variable with the distribution in question: \n  \n    \n      \n        \n          φ\n          \n            X\n          \n        \n        (\n        t\n        )\n        =\n        E\n        ⁡\n        \n          (\n          \n            e\n            \n              i\n              t\n              X\n            \n          \n          )\n        \n        ,\n      \n    \n    {\\displaystyle \\varphi _{X}(t)=\\operatorname {E} \\left(e^{itX}\\right),}\n  \n where \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle \\operatorname {E} }\n  \n denotes expected value. For multivariate distributions, the product tX is replaced by a scalar product of vectors.\nThe characteristic function of a cooperative game in game theory.\nThe characteristic polynomial in linear algebra.\nThe characteristic state function in statistical mechanics.\nThe Euler characteristic, a topological invariant.\nThe receiver operating characteristic in statistical decision theory.\nThe point characteristic function in statistics.\n\n",
    "convective": "Convection is single or multiphase fluid flow that occurs spontaneously through the combined effects of material property heterogeneity and body forces on a fluid, most commonly density and gravity (see buoyancy). When the cause of the convection is unspecified, convection due to the effects of thermal expansion and buoyancy can be assumed. Convection may also take place in soft solids or mixtures where particles can flow.\n\nConvective flow may be transient (such as when a multiphase mixture of oil and water separates) or steady state (see convection cell). The convection may be due to gravitational, electromagnetic or fictitious body forces. Heat transfer by natural convection plays a role in the structure of Earth's atmosphere, its oceans, and its mantle. Discrete convective cells in the atmosphere can be identified by clouds, with stronger convection resulting in thunderstorms. Natural convection also plays a role in stellar physics. Convection is often categorised or described by the main effect causing the convective flow; for example, thermal convection.\nConvection cannot take place in most solids because neither bulk current flows nor significant diffusion of matter can take place. \nGranular convection is a similar phenomenon in granular material instead of fluids.\nAdvection is fluid motion created by velocity instead of thermal gradients.\nConvective heat transfer is the intentional use of convection as a method for heat transfer. Convection is a process in which heat is carried from place to place by the bulk movement of a fluid.\n\n",
    "dvl": "The DVL-XXXX Series of LaserDisc home video players were manufactured by Pioneer Corporation and were some of the last LaserDisc players manufactured before the format's retirement. They Included the capability of playing LaserDisc, CD Video, Audio CD, and DVD.",
    "thickness": "In formal language theory, in particular in algorithmic learning theory, a class C of languages has finite thickness if every string is contained in at most finitely many languages in C. This condition was introduced by Dana Angluin as a sufficient condition for C being identifiable in the limit.",
    "sommerfeld": "Arnold Johannes Wilhelm Sommerfeld (German: [ˈaʁnɔlt joˈhanəs ˈvɪlhɛlm ˈzɔmɐˌfɛlt]; 5 December 1868 – 26 April 1951) was a German theoretical physicist who pioneered developments in atomic and quantum physics, and also educated and mentored many students for the new era of theoretical physics. He served as doctoral supervisor and postdoc supervisor to seven Nobel Prize winners and supervised at least 30 other famous physicists and chemists. Only J. J. Thomson's record of mentorship offers a comparable list of high-achieving students.\nHe introduced the second quantum number, azimuthal quantum number, and the third quantum number, magnetic quantum number. He also introduced the fine-structure constant and pioneered X-ray wave theory.",
    "magnetofluidmechanics": "This is a bibliography of works by Theodore von Kármán.",
    "electrohydrodynamic": "Electrohydrodynamics (EHD), also known as electro-fluid-dynamics (EFD) or electrokinetics, is the study of the dynamics of electrically charged fluids. Electrohydrodynamics (EHD) is a joint domain of electrodynamics and fluid dynamics mainly focused on the fluid motion induced by electric fields. EHD, in its simplest form, involves the application of an electric field to a fluid medium, resulting in fluid flow, form, or properties manipulation. These mechanisms arise from the interaction between the electric fields and charged particles or polarization effects within the fluid. The generation and movement of charge carriers (ions) in a fluid subjected to an electric field are the underlying physics of all EHD-based technologies.\n\nThe electric forces acting on particles consist of electrostatic (Coulomb) and electrophoresis force (first term in the following equation)., dielectrophoretic force (second term in the following equation), and electrostrictive force (third term in the following equation):\n\n  \n    \n      \n        \n          F\n          \n            e\n          \n        \n        =\n        \n          ρ\n          \n            e\n          \n        \n        \n          \n            E\n            →\n          \n        \n        −\n        \n          \n            1\n            2\n          \n        \n        \n          ε\n          \n            0\n          \n        \n        \n          \n            \n              E\n              →\n            \n          \n          \n            2\n          \n        \n        ▽\n        \n          ε\n          \n            r\n          \n        \n        +\n        \n          \n            1\n            2\n          \n        \n        \n          ε\n          \n            0\n          \n        \n        ▽\n        \n          \n            (\n          \n        \n        \n          \n            \n              E\n              →\n            \n          \n          \n            2\n          \n        \n        \n          ρ\n          \n            f\n          \n        \n        \n          (\n          \n            \n              \n                ∂\n                \n                  ε\n                  \n                    r\n                  \n                \n              \n              \n                ∂\n                \n                  ρ\n                  \n                    f\n                  \n                \n              \n            \n          \n          )\n        \n        \n          \n            )\n          \n        \n      \n    \n    {\\displaystyle F_{e}=\\rho _{e}{\\overrightarrow {E}}-{1 \\over 2}\\varepsilon _{0}{\\overrightarrow {E}}^{2}\\triangledown \\varepsilon _{r}+{1 \\over 2}\\varepsilon _{0}\\triangledown {\\Bigl (}{\\overrightarrow {E}}^{2}\\rho _{f}\\left({\\frac {\\partial \\varepsilon _{r}}{\\partial \\rho _{f}}}\\right){\\Bigr )}}\n  \n\nThis electrical force is then inserted in Navier-Stokes equation, as a body (volumetric) force.EHD covers the following types of particle and fluid transport mechanisms: electrophoresis, electrokinesis, dielectrophoresis, electro-osmosis, and electrorotation. In general, the phenomena relate to the direct conversion of electrical energy into kinetic energy, and vice versa.\nIn the first instance, shaped electrostatic fields (ESF's) create hydrostatic pressure (HSP, or motion) in dielectric media. When such media are fluids, a flow is produced. If the dielectric is a vacuum or a solid, no flow is produced. Such flow can be directed against the electrodes, generally to move the electrodes. In such case, the moving structure acts as an electric motor. Practical fields of interest of EHD are the common air ioniser, electrohydrodynamic thrusters and EHD cooling systems.\nIn the second instance, the converse takes place. A powered flow of medium within a shaped electrostatic field adds energy to the system which is picked up as a potential difference by electrodes. In such case, the structure acts as an electrical generator.\n\n",
    "intuition": "Intuition is the ability to acquire knowledge, without recourse to conscious reasoning or needing an explanation. Different fields use the word \"intuition\" in very different ways, including but not limited to: direct access to unconscious knowledge; unconscious cognition; gut feelings; inner sensing; inner insight to unconscious pattern-recognition; and the ability to understand something instinctively, without any need for conscious reasoning. Intuitive knowledge tends to be approximate.\nThe word intuition comes from the Latin verb intueri translated as \"consider\" or from the late middle English word intuit, \"to contemplate\". Use of intuition is sometimes referred to as responding to a \"gut feeling\" or \"trusting your gut\".\n\n",
    "drosophila": "Drosophila (), from Ancient Greek δρόσος (drósos), meaning \"dew\", and φίλος (phílos), meaning \"loving\", is a genus of fly, belonging to the family Drosophilidae, whose members are often called \"small fruit flies\" or pomace flies, vinegar flies, or wine flies, a reference to the characteristic of many species to linger around overripe or rotting fruit. They should not be confused with the Tephritidae, a related family, which are also called fruit flies (sometimes referred to as \"true fruit flies\"); tephritids feed primarily on unripe or ripe fruit, with many species being regarded as destructive agricultural pests, especially the Mediterranean fruit fly.\nOne species of Drosophila in particular, Drosophila melanogaster, has been heavily used in research in genetics and is a common model organism in developmental biology. The terms \"fruit fly\" and \"Drosophila\" are often used synonymously with D. melanogaster in modern biological literature. The entire genus, however, contains more than 1,500 species and is very diverse in appearance, behavior, and breeding habitat.",
    "sweptback": "A swept wing is a wing angled either backward or occasionally forward from its root rather than perpendicular to the fuselage.\nSwept wings have been flown since the pioneer days of aviation. Wing sweep at high speeds was first investigated in Germany as early as 1935 by Albert Betz and Adolph Busemann, finding application just before the end of the Second World War. It has the effect of delaying the shock waves and accompanying aerodynamic drag rise caused by fluid compressibility near the speed of sound, improving performance. Swept wings are therefore almost always used on jet aircraft designed to fly at these speeds.\nThe term \"swept wing\" is normally used to mean \"swept back\", but variants include forward sweep, variable sweep wings and oblique wings in which one side sweeps forward and the other back. The delta wing is also aerodynamically a form of swept wing.\n\n",
    "superaerodynamic": "Qian Xuesen (Chinese: 钱学森; December 11, 1911 – October 31, 2009; also spelled as Tsien Hsue-shen) was a Chinese aerospace engineer and cyberneticist who made significant contributions to the field of aerodynamics and established engineering cybernetics. He achieved recognition as one of America's leading experts in rockets and high-speed flight theory prior to his returning to China in 1955.\nQian received his undergraduate education in mechanical engineering at National Chiao Tung University in Shanghai in 1934. He traveled to the United States in 1935 and attained a master's degree in aeronautical engineering at the Massachusetts Institute of Technology in 1936. Afterward, he joined Theodore von Kármán's group at the California Institute of Technology in 1936, received a doctorate in aeronautics and mathematics there in 1939, and became an associate professor at Caltech in 1943. While at Caltech, he co-founded NASA's Jet Propulsion Laboratory. He was recruited by the United States Department of Defense and the Department of War to serve in various positions, including as an expert consultant with a rank of colonel in 1945. At the same time, he became an associate professor at MIT in 1946, a full professor at MIT in 1947, and a full professor at Caltech in 1949.\nDuring the Second Red Scare in the 1950s, the United States federal government accused him of communist sympathies. In 1950, despite protests by his colleagues and without any evidence of the allegations, he was stripped of his security clearance. He was given a deferred deportation order by the Immigration and Naturalization Service, and for the following five years, he and his family were subjected to partial house arrest and government surveillance in an effort to gradually make his technical knowledge obsolete.  After spending five years under house arrest, he was released in 1955 in exchange for the repatriation of American pilots who had been captured during the Korean War. He left the United States in September 1955 on the American President Lines passenger liner SS President Cleveland, arriving in mainland China via Hong Kong.\nUpon his return, he helped lead development of the Dongfeng ballistic missile and the Chinese space program. He also played a significant part in the construction and development of China's defense industry, higher education and research system, rocket force, and a key technology university. For his contributions, he became known as the \"Father of Chinese Rocketry\", nicknamed the \"King of Rocketry\". He is recognized as one of the founding fathers of Two Bombs, One Satellite.\nIn 1957, Qian was elected an academician of the Chinese Academy of Sciences. He served as a Vice Chairman of the National Committee of the Chinese People's Political Consultative Conference from 1987 to 1998.\nHe was the cousin of engineer Hsue-Chu Tsien, who was involved in the aerospace industries of both China and the United States. His nephew, Roger Y. Tsien, was the 2008 winner of the Nobel Prize in Chemistry.\n\n",
    "rankine": "Rankine is a surname. Notable people with the surname include:\n\nWilliam Rankine (1820–1872), Scottish engineer and physicist\nRankine body an elliptical shape of significance in fluid dynamics, named for Rankine\nRankine scale, an absolute-temperature scale related to the Fahrenheit scale, named for Rankine\nRankine cycle, a thermodynamic heat-engine cycle, also named after Rankine\nRankine Lecture, a lecture delivered annually by an expert in the field of geotechnics\nAlan Rankine (born 1958), Scottish rock musician\nAlexander Rankine (1881–1956), British physicist\nAndy Rankine (1895–1965), Scottish footballer\nCamille Rankine, American poet\nClaudia Rankine (born 1963), American poet and playwright\nDean Rankine, Australian comics artist\nGeorge Rankine Irwin, (1907–1998) American materials scientist\nJames Rankine (1828–1897), South Australian politician\nJennifer Rankine (born 1953), South Australian politician\nJohn Rankine (1918–2013), British science fiction author\nJohn Rankine (Australian politician) (1801–1864), South Australian physician and politician\nJohn Rankine (governor) (1907–1987), British colonial administrator\nLeila Rankine (1932–1993), Aboriginal Australian poet, co-founder of the Centre for Aboriginal Studies in Music at the University of Adelaide\nMark Rankine (born 1969), English footballer\nMichael Rankine (born 1985), English footballer\nScotty Rankine (1909–1995), Canadian Olympic athlete\nThomas Rankine (born 1978), American musician\nWilliam Rankine Milligan, Lord Milligan (1898–1975), Scottish judge and politician\n\n",
    "axial": "Axial Seamount (also Coaxial Seamount or Axial Volcano) is a seamount, submarine volcano, and underwater shield volcano in the Pacific Ocean, located on the Juan de Fuca Ridge, approximately 480 km (298 mi) west of Cannon Beach, Oregon. Standing 1,100 m (3,609 ft) high, Axial Seamount is the youngest volcano and current eruptive center of the Cobb–Eickelberg Seamount chain. Located at the center of both a geological hotspot and a mid-ocean ridge, the seamount is geologically complex, and its origins are still poorly understood. Axial Seamount is set on a long, low-lying plateau, with two large rift zones trending 50 km (31 mi) to the northeast and southwest of its center. The volcano features an unusual rectangular caldera, and its flanks are pockmarked by fissures, vents, sheet flows, and pit craters up to 100 m (328 ft) deep; its geology is further complicated by its intersection with several smaller seamounts surrounding it.\nAxial Seamount was first detected in the 1970s by satellite altimetry, and mapped and explored by Pisces IV, DSV Alvin, and others through the 1980s. A large package of sensors was dropped on the seamount through 1992, and the New Millennium Observatory was established on its flanks in 1996. Axial Seamount received significant scientific attention following the seismic detection of a submarine eruption at the volcano in January 1998, the first time a submarine eruption had been detected and followed in situ. Subsequent cruises and analysis showed that the volcano had generated lava flows up to 13 m (43 ft) thick, and the total eruptive volume was found to be 0.018–0.076 km3 (0.0043–0.0182 cu mi). Axial Seamount erupted again in April 2011, producing a mile-wide lava flow. There was another eruption in 2015 and another is expected in 2025.",
    "bypass": "A turbofan or fanjet is a type of airbreathing jet engine that is widely used in aircraft propulsion. The word \"turbofan\" is a combination of references to the preceding generation engine technology of the turbojet and the additional fan stage. It consists of a gas turbine engine which achieves mechanical energy from combustion, and a ducted fan that uses the mechanical energy from the gas turbine to force air rearwards. Thus, whereas all the air taken in by a turbojet passes through the combustion chamber and turbines, in a turbofan some of that air bypasses these components. A turbofan thus can be thought of as a turbojet being used to drive a ducted fan, with both of these contributing to the thrust.\nThe ratio of the mass-flow of air bypassing the engine core to the mass-flow of air passing through the core is referred to as the bypass ratio. The engine produces thrust through a combination of these two portions working together. Engines that use more jet thrust relative to fan thrust are known as low-bypass turbofans; conversely those that have considerably more fan thrust than jet thrust are known as high-bypass. Most commercial aviation jet engines in use are of the high-bypass type, and most modern fighter engines are low-bypass. Afterburners are used on low-bypass turbofan engines with bypass and core mixing before the afterburner.\nModern turbofans have either a large single-stage fan or a smaller fan with several stages. An early configuration combined a low-pressure turbine and fan in a single rear-mounted unit.",
    "hypervelocity": "Hypervelocity is very high velocity, approximately over 3,000 meters per second (11,000 km/h, 6,700 mph, 10,000 ft/s, or Mach 8.8). In particular, hypervelocity is velocity so high that the strength of materials upon impact is very small compared to inertial stresses. Thus, metals and fluids behave alike under hypervelocity impact. An impact under extreme hypervelocity results in vaporization of the impactor and target. For structural metals, hypervelocity is generally considered to be over 2,500 m/s (5,600 mph, 9,000 km/h, 8,200 ft/s, or Mach 7.3).  Meteorite craters are also examples of hypervelocity impacts.\n\n",
    "formulation": "Formulation is a term used in various senses in various applications, both the material and the abstract or formal. Its fundamental meaning is the putting together of components in appropriate relationships or structures, according to a formula. Etymologically formula is the diminutive of the Latin forma, meaning shape. In that sense a formulation is created according to the standard for the product.\n\n",
    "stage": "The Stage is a British weekly newspaper and website covering the entertainment industry and particularly theatre. Founded in 1880, The Stage contains news, reviews, opinion, features, and recruitment advertising, mainly directed at those who work in theatre and the performing arts.\n\n",
    "absorption": "An absorption refrigerator is a refrigerator that uses a heat source to provide the energy needed to drive the cooling process. Solar energy, burning a fossil fuel, waste heat from factories, and district heating systems are examples of heat sources that can be used. An absorption refrigerator uses two coolants: the first coolant performs evaporative cooling and then is absorbed into the second coolant; heat is needed to reset the two coolants to their initial states. Absorption refrigerators are commonly used in recreational vehicles (RVs), campers, and caravans because the heat required to power them can be provided by a propane fuel burner, by a low-voltage DC electric heater (from a battery or vehicle electrical system) or by a mains-powered electric heater. Absorption refrigerators can also be used to air-condition buildings using the waste heat from a gas turbine or water heater in the building. Using waste heat from a gas turbine makes the turbine very efficient because it first produces electricity, then hot water, and finally, air-conditioning—trigeneration.\nUnlike more common vapor-compression refrigeration systems, an absorption refrigerator has no moving parts.\n\n",
    "reanalysis": "Folk etymology – also known as (generative) popular etymology, analogical reformation, (morphological) reanalysis and etymological reinterpretation – is a change in a word or phrase resulting from the replacement of an unfamiliar form by a more familiar one through popular usage. The form or the meaning of an archaic, foreign, or otherwise unfamiliar word is reinterpreted as resembling more familiar words or morphemes.\nThe term folk etymology is a loan translation from German Volksetymologie, coined by  Ernst Förstemann in 1852. Folk etymology is a productive process in historical linguistics, language change, and social interaction. Reanalysis of a word's history or original form can affect its spelling, pronunciation, or meaning. This is frequently seen in relation to loanwords or words that have become archaic or obsolete.\nFolk/popular etymology may also refer to a popular false belief about the etymology of a word or phrase that does not lead to a change in the form or meaning. To disambiguate the usage of the term \"folk/popular etymology\", Ghil'ad Zuckermann proposes a clear-cut distinction between the derivational-only popular etymology (DOPE) and the generative popular etymology (GPE): the DOPE refers to a popular false etymology involving no neologization, and the GPE refers to neologization generated by a popular false etymology.\nExamples of words created or changed through folk etymology include the English dialectal form sparrowgrass, originally from Greek ἀσπάραγος (\"asparagus\") remade by analogy to the more familiar words sparrow and grass. When the alteration of an unfamiliar word is limited to a single person, it is known as an eggcorn.",
    "undeformed": "In continuum mechanics, the finite strain theory—also called large strain theory, or large deformation theory—deals with deformations in which strains and/or rotations are large enough to invalidate assumptions inherent in infinitesimal strain theory.  In this case, the undeformed and deformed configurations of the continuum are significantly different, requiring a clear distinction between them. This is commonly the case with elastomers, plastically deforming materials and other fluids and biological soft tissue.\n\n",
    "prospect": "Prospect theory is a theory of behavioral economics, judgment and decision making that was developed by Daniel Kahneman and Amos Tversky in 1979. The theory was cited in the decision to award Kahneman the 2002 Nobel Memorial Prize in Economics.\nBased on results from controlled studies, it describes how individuals assess their loss and gain perspectives in an asymmetric manner (see loss aversion). For example, for some individuals, the pain from losing $1,000 could only be compensated by the pleasure of earning $2,000. Thus, contrary to the expected utility theory (which models the decision that perfectly rational agents would make), prospect theory aims to describe the actual behavior of people.\nIn the original formulation of the theory, the term prospect referred to the predictable results of a lottery. However, prospect theory can also be applied to the prediction of other forms of behaviors and decisions.\nProspect theory challenges the expected utility theory developed by John von Neumann and Oskar Morgenstern in 1944 and constitutes one of the first economic theories built using experimental methods.",
    "afterburner": "An afterburner (or reheat in British English) is an additional combustion component used on some jet engines, mostly those on military supersonic aircraft. Its purpose is to increase thrust, usually for supersonic flight, takeoff, and combat. The afterburning process injects additional fuel into a combustor (\"burner\") in the jet pipe behind (i.e., \"after\") the turbine, \"reheating\" the exhaust gas. Afterburning significantly increases thrust as an alternative to using a bigger engine with its added weight penalty, but at the cost of increased fuel consumption (decreased fuel efficiency) which limits its use to short periods. This aircraft application of \"reheat\" contrasts with the meaning and implementation of \"reheat\" applicable to gas turbines driving electrical generators and which reduces fuel consumption.\n\nJet engines are referred to as operating wet when afterburning and dry when not. An engine producing maximum thrust wet is at maximum power, while an engine producing maximum thrust dry is at military power.\n\n",
    "derivation": "In mathematics, a derivation is a function on an algebra that generalizes certain features of the derivative operator.  Specifically, given an algebra A over a ring or a field K, a K-derivation is a K-linear map D : A → A that satisfies Leibniz's law:\n\n  \n    \n      \n        D\n        (\n        a\n        b\n        )\n        =\n        a\n        D\n        (\n        b\n        )\n        +\n        D\n        (\n        a\n        )\n        b\n        .\n      \n    \n    {\\displaystyle D(ab)=aD(b)+D(a)b.}\n  \n\nMore generally, if M is an A-bimodule, a K-linear map D : A → M that satisfies the Leibniz law is also called a derivation.  The collection of all K-derivations of A to itself is denoted by DerK(A).  The collection of K-derivations of A into an A-module M is denoted by DerK(A, M).\nDerivations occur in many different contexts in diverse areas of mathematics.  The partial derivative with respect to a variable is an R-derivation on the algebra of real-valued differentiable functions on Rn.  The Lie derivative with respect to a vector field is an R-derivation on the algebra of differentiable functions on a differentiable manifold; more generally it is a derivation on the tensor algebra of a manifold. It follows that the adjoint representation of a Lie algebra is a derivation on that algebra. The Pincherle derivative is an example of a derivation in abstract algebra. If the algebra A is noncommutative, then the commutator with respect to an element of the algebra A defines a linear endomorphism of A to itself, which is a derivation over K. That is,\n\n  \n    \n      \n        [\n        F\n        G\n        ,\n        N\n        ]\n        =\n        [\n        F\n        ,\n        N\n        ]\n        G\n        +\n        F\n        [\n        G\n        ,\n        N\n        ]\n        ,\n      \n    \n    {\\displaystyle [FG,N]=[F,N]G+F[G,N],}\n  \n\nwhere \n  \n    \n      \n        [\n        ⋅\n        ,\n        N\n        ]\n      \n    \n    {\\displaystyle [\\cdot ,N]}\n  \n is the commutator with respect to \n  \n    \n      \n        N\n      \n    \n    {\\displaystyle N}\n  \n. An algebra A equipped with a distinguished derivation d forms a differential algebra, and is itself a significant object of study in areas such as differential Galois theory.",
    "conservativeness": "The Conservative and Unionist Party, commonly the Conservative Party and colloquially known as the Tories, is one of the two main political parties in the United Kingdom, along with the Labour Party. The party sits on the centre-right to right-wing of the left-right political spectrum. Following its defeat by Labour at the 2024 general election it is currently the second-largest party by the number of votes cast and number of seats in the House of Commons; as such it has the formal parliamentary role of His Majesty's Most Loyal Opposition. It encompasses various ideological factions including one-nation conservatives, Thatcherites and traditionalist conservatives. There have been 20 Conservative prime ministers. The party traditionally holds the annual Conservative Party Conference during party conference season, at which senior figures promote party policy. \nThe Conservative Party was founded in 1834 from the Tory Party and was one of two dominant political parties in the 19th century, along with the Liberal Party. Under Benjamin Disraeli it played a preeminent role in politics at the height of the British Empire. In 1912 the Liberal Unionist Party merged with the party to form the Conservative and Unionist Party. Its rivalry with the Labour Party has shaped modern British politics for the last century. David Cameron sought to modernise the party after his election as leader in 2005, and the party governed from 2010 to 2024 under five prime ministers, latterly Rishi Sunak.\nThe party has generally adopted liberal economic policies favouring free markets since the 1980s, although historically it advocated protectionism. The party is British unionist, opposing a united Ireland as well as English, Northern Irish, Scottish and Welsh independence, and has been critical of devolution. Historically the party supported the continuance and maintenance of the British Empire. The party has taken various approaches towards the European Union (EU), with Eurosceptic and, to a decreasing extent, pro-European factions within it. Historically the party took a socially conservative approach. In defence policy it supports an independent nuclear weapons programme and commitment to NATO membership.\nFor much of modern British political history the United Kingdom exhibited a wide urban–rural political divide; the party's voting and financial support base has historically consisted primarily of homeowners, business-owners, farmers, real-estate-developers and middle-class voters, especially in rural and suburban areas of England. Since the EU membership referendum in 2016 the Conservatives have targeted working-class voters from traditional Labour strongholds. The party's domination of British politics throughout the 20th century made it one of the most electorally successful political parties in the Western world and in human history. The most recent period of Conservative government was marked by extraordinary political turmoil.",
    "deduction": "Under United States tax law, the standard deduction is a dollar amount that non-itemizers may subtract from their income before income tax (but not other kinds of tax, such as payroll tax) is applied. Taxpayers may choose either itemized deductions or the standard deduction, but usually choose whichever results in the lesser amount of tax payable. The standard deduction is available to individuals who are US citizens or resident aliens. The standard deduction is based on filing status and typically increases each year, based on inflation measurements from the previous year. It is not available to nonresident aliens residing in the United States (with few exceptions, for example, students from India on F1 visa status can use the standard deduction). Additional amounts are available for persons who are blind and/or are at least 65 years of age.\nThe standard deduction is distinct from the personal exemption, which was set to $0 by the Tax Cuts and Jobs Act of 2017 for tax years 2018–2025.",
    "asymptote": "In analytic geometry, an asymptote () of a curve is a line such that the distance between the curve and the line approaches zero as one or both of the x or y coordinates tends to infinity. In projective geometry and related contexts, an asymptote of a curve is a line which is tangent to the curve at a point at infinity.\nThe word asymptote is derived from the Greek ἀσύμπτωτος (asumptōtos) which means \"not falling together\", from ἀ priv. + σύν \"together\" + πτωτ-ός \"fallen\". The term was introduced by Apollonius of Perga in his work on conic sections, but in contrast to its modern meaning, he used it to mean any line that does not intersect the given curve.\nThere are three kinds of asymptotes: horizontal, vertical and oblique. For curves given by the graph of a function y = ƒ(x), horizontal asymptotes are horizontal lines that the graph of the function approaches as x tends to +∞ or −∞.  Vertical asymptotes are vertical lines near which the function grows without bound. An oblique asymptote has a slope that is non-zero but finite, such that the graph of the function approaches it as x tends to +∞ or −∞.\nMore generally, one curve is a curvilinear asymptote of another (as opposed to a linear asymptote) if the distance between the two curves tends to zero as they tend to infinity, although the term asymptote by itself is usually reserved for linear asymptotes.\nAsymptotes convey information about the behavior of curves in the large, and determining the asymptotes of a function is an important step in sketching its graph.  The study of asymptotes of functions, construed in a broad sense, forms a part of the subject of asymptotic analysis.\n\n",
    "ii": "A numeral (often called number in Unicode) is a character that denotes a number. The decimal number digits 0–9 are used widely in various writing systems throughout the world, however the graphemes representing the decimal digits differ widely. Therefore Unicode includes 22 different sets of graphemes for the decimal digits, and also various decimal points, thousands separators, negative signs, etc. Unicode also includes several non-decimal numerals such as Aegean numerals, Roman numerals, counting rod numerals, Mayan numerals, Cuneiform numerals and ancient Greek numerals. There is also a large number of typographical variations of the Western Arabic numerals provided for specialized mathematical use and for compatibility with earlier character sets, such as ² or ②, and composite characters such as ½.\n\n",
    "ascertained": "In the United States, a certificate of ascertainment is an official document that identifies a state's appointed electors for U.S. President and Vice President, and the final vote count for each candidate that received popular votes.\n\n",
    "simulating": "A simulation is an imitative representation of a process or system that could exist in the real world. In this broad sense, simulation can often be used interchangeably with model. Sometimes a clear distinction between the two terms is made, in which simulations require the use of models; the model represents the key characteristics or behaviors of the selected system or process, whereas the simulation represents the evolution of the model over time. Another way to distinguish between the terms is to define simulation as experimentation with the help of a model. This definition includes time-independent simulations. Often, computers are used to execute the simulation.\nSimulation is used in many contexts, such as simulation of technology for performance tuning or optimizing, safety engineering, testing, training, education, and video games. Simulation is also used with scientific modelling of natural systems or human systems to gain insight into their functioning, as in economics. Simulation can be used to show the eventual real effects of alternative conditions and courses of action. Simulation is also used when the real system cannot be engaged, because it may not be accessible, or it may be dangerous or unacceptable to engage, or it is being designed but not yet built, or it may simply not exist.\nKey issues in modeling and simulation include the acquisition of valid sources of information about the relevant selection of key characteristics and behaviors used to build the model, the use of simplifying approximations and assumptions within the model, and fidelity and validity of the simulation outcomes. Procedures and protocols for model verification and validation are an ongoing field of academic study, refinement, research and development in simulations technology or practice, particularly in the work of computer simulation.\n\n",
    "redirecting": "URL redirection, also called URL forwarding, is a World Wide Web technique for making a web page available under more than one URL address. When a web browser attempts to open a URL that has been redirected, a page with a different URL is opened. Similarly, domain redirection or domain forwarding is when all pages in a URL domain are redirected to a different domain, as when wikipedia.com and wikipedia.net are automatically redirected to wikipedia.org.\nURL redirection is done for various reasons:\n\nfor URL shortening;\nto prevent broken links when web pages are moved;\nto allow multiple domain names belonging to the same owner to refer to a single web site;\nto guide navigation into and out of a website;\nfor privacy protection (such as redirecting YouTube and Twitter links to Invidious and Nitter respectively or to turn AMP links into normal links); and\nfor hostile purposes such as phishing attacks or malware distribution.",
    "define": "A definition is a statement of the meaning of a term (a word, phrase, or other set of symbols). Definitions can be classified into two large categories: intensional definitions (which try to give the sense of a term), and extensional definitions (which try to list the objects that a term describes). Another important category of definitions is the class of ostensive definitions, which convey the meaning of a term by pointing out examples. A term may have many different senses and multiple meanings, and thus require multiple definitions.\nIn mathematics, a definition is used to give a precise meaning to a new term, by describing a condition which unambiguously qualifies what the mathematical term is and is not. Definitions and axioms form the basis on which all of modern mathematics is to be constructed.\n\n",
    "lyapunov": "Lyapunov (Russian: Ляпунов, in old-Russian often written Лепунов) is a Russian surname that is sometimes also romanized as Ljapunov, Liapunov or Ljapunow. Notable people with the surname include:\n\nAlexey Lyapunov (1911–1973), Russian mathematician\nAleksandr Lyapunov (1857–1918), son of Mikhail (1820–1868), Russian mathematician and mechanician, after whom the following are named:\nLyapunov dimension\nLyapunov equation\nLyapunov exponent\nLyapunov function\nLyapunov fractal\nLyapunov stability\nLyapunov's central limit theorem\nLyapunov time\nLyapunov vector\nLyapunov (crater)\nBoris Lyapunov (1862–1943), son of Mikhail (1820–1868), Russian expert in Slavic studies\nMikhail Lyapunov (1820–1868), Russian astronomer\nMikhail Nikolaevich Lyapunov (1848–1909), Russian military officer and lawyer\nProkopy Lyapunov (d. 1611), Russian statesman\nSergei Lyapunov (1859–1924), son of Mikhail (1820–1868), Russian composer\nZakhary Lyapunov (d. after 1612), Russian statesman, Prokopy Lyapunov's brother\n\n",
    "induce": "In molecular biology, an inducer is a molecule that regulates gene expression. An inducer functions in two ways; namely:\n\nBy disabling repressors. The gene is expressed because an inducer binds to the repressor. The binding of the inducer to the repressor prevents the repressor from binding to the operator. RNA polymerase can then begin to transcribe operon genes.\nBy binding to activators. Activators generally bind poorly to activator DNA sequences unless an inducer is present. Activator binds to an inducer and the complex binds to the activation sequence and activates target gene. Removing the inducer stops transcription.\nBecause a small inducer molecule is required, the increased expression of the target gene is called induction. The lactose operon is one example of an inducible system.",
    "dissertation": "A thesis (pl.: theses), or dissertation (abbreviated diss.), is a document submitted in support of candidature for an academic degree or professional qualification presenting the author's research and findings. In some contexts, the word thesis or a cognate is used for part of a bachelor's or master's course, while dissertation is normally applied to a doctorate. This is the typical arrangement in American English. In other contexts, such as within most institutions of the United Kingdom, South Africa, the Commonwealth Countries, and Brazil, the reverse is true. The term graduate thesis is sometimes used to refer to both master's theses and doctoral dissertations.\nThe required complexity or quality of research of a thesis or dissertation can vary by country, university, or program, and the required minimum study period may thus vary significantly in duration.\nThe word dissertation can at times be used to describe a treatise without relation to obtaining an academic degree. The term thesis is also used to refer to the general claim of an essay or similar work.\n\n",
    "reshotko": "Socrates (; Ancient Greek: Σωκράτης, romanized: Sōkrátēs; c. 470 – 399 BC) was a Greek philosopher from Athens who is credited as the founder of Western philosophy and as among the first moral philosophers of the ethical tradition of thought. An enigmatic figure, Socrates authored no texts and is known mainly through the posthumous accounts of classical writers, particularly his students Plato and Xenophon. These accounts are written as dialogues, in which Socrates and his interlocutors examine a subject in the style of question and answer; they gave rise to the Socratic dialogue literary genre. Contradictory accounts of Socrates make a reconstruction of his philosophy nearly impossible, a situation known as the Socratic problem. Socrates was a polarizing figure in Athenian society. In 399 BC, he was accused of impiety and corrupting the youth. After a trial that lasted a day, he was sentenced to death. He spent his last day in prison, refusing offers to help him escape.\nPlato's dialogues are among the most comprehensive accounts of Socrates to survive from antiquity. They demonstrate the Socratic approach to areas of philosophy including epistemology and ethics. The Platonic Socrates lends his name to the concept of the Socratic method, and also to Socratic irony. The Socratic method of questioning, or elenchus, takes shape in dialogue using short questions and answers, epitomized by those Platonic texts in which Socrates and his interlocutors examine various aspects of an issue or an abstract meaning, usually relating to one of the virtues, and find themselves at an impasse, completely unable to define what they thought they understood. Socrates is known for proclaiming his total ignorance; he used to say that the only thing he was aware of was his ignorance, seeking to imply that the realization of one's ignorance is the first step in philosophizing.\nSocrates exerted a strong influence on philosophers in later antiquity and has continued to do so in the modern era. He was studied by medieval and Islamic scholars and played an important role in the thought of the Italian Renaissance, particularly within the humanist movement. Interest in him continued unabated, as reflected in the works of Søren Kierkegaard and Friedrich Nietzsche. Depictions of Socrates in art, literature, and popular culture have made him a widely known figure in the Western philosophical tradition.\n\n",
    "appendix": "The appendix (pl.: appendices or appendixes; also vermiform appendix;  cecal (or caecal, cæcal) appendix; vermix; or vermiform process) is a finger-like, blind-ended tube connected to the cecum, from which it develops in the embryo. \nThe cecum is a pouch-like structure of the large intestine, located at the junction of the small and the large intestines. The term \"vermiform\" comes from Latin and means \"worm-shaped\". The appendix was once considered a vestigial organ, but this view has changed since the early 2000s. Research suggests that the appendix may serve as a reservoir for beneficial gut bacteria.",
    "actual": "Actual play, also called live play, is a genre of podcast or web show in which people play tabletop role-playing games (TTRPGs) for an audience. Actual play often encompasses in-character interactions between players, storytelling from the gamemaster, and out-of-character engagements such as dice rolls and discussion of game mechanics. The genre emerged in the early 2000s and became more popular throughout the decade, particularly with the 2015 debut of Critical Role, an actual play webseries featuring professional voice actors.",
    "1947": "1947 (MCMXLVII) was a common year starting on Wednesday of the Gregorian calendar, the 1947th year of the Common Era (CE) and Anno Domini (AD) designations, the 947th  year of the 2nd millennium, the 47th  year of the 20th century, and the  8th   year of the 1940s decade.  \nIt was the first year of the Cold War, which would last until 1991, ending with the dissolution of the Soviet Union.",
    "threaten": "A threat is a communication of intent to inflict harm or loss on another person. Intimidation is a tactic used between conflicting parties to make the other timid or psychologically insecure for coercion or control. The act of intimidation for coercion is considered a threat.\nThreatening or threatening behavior (or criminal threatening behavior) is the crime of intentionally or knowingly putting another person in fear of bodily injury.\nSome of the more common types of threats forbidden by law are those made with an intent to obtain a monetary advantage or to compel a person to act against their will. In most U.S. states, it is an offense to threaten to (1) use a deadly weapon on another person; (2) injure another's person or property; or (3) injure another's reputation.",
    "discontinuity": "Continuous functions are of utmost importance in mathematics, functions and applications. However, not all functions are continuous. If a function is not continuous at a limit point (also called \"accumulation point\" or \"cluster point\") of its domain, one says that it has a discontinuity there. The set of all points of discontinuity of a function may be a discrete set, a dense set, or even the entire domain of the function.\nThe oscillation of a function at a point quantifies these discontinuities as follows:\n\nin a removable discontinuity, the distance that the value of the function is off by is the oscillation;\nin a jump discontinuity, the size of the jump is the oscillation (assuming that the value at the point lies between these limits of the two sides);\nin an essential discontinuity (a.k.a. infinite discontinuity), oscillation measures the failure of a limit to exist.\nA special case is if the function diverges to infinity or minus infinity, in which case the oscillation is not defined (in the extended real numbers, this is a removable discontinuity).\n\n",
    "enjoy": "\"Enjoy the Silence\" is a song by the English electronic music band Depeche Mode. Written by Martin Gore and recorded in 1989, it was released as the second single from their seventh studio album, Violator (1990), on 5 February 1990 by Mute Records. The song topped the charts of Denmark and Spain and is the band's highest-charting single in the United States, peaking at number eight on the Billboard Hot 100. It won an award in the category of Best British Single at the Brit Awards 1991. The music video for the song was directed by Anton Corbijn and references The Little Prince from Antoine de Saint-Exupéry. In the video, Dave Gahan appears, dressed as a king, wandering in the hillsides with a deck chair.\n\"Enjoy the Silence\" was re-released as a single in 2004 for the Depeche Mode remix project Remixes 81–04, and was titled \"Enjoy the Silence (Reinterpreted)\" or, more simply, \"Enjoy the Silence 04\".",
    "0001": "The 0s began on January 1, AD 1 and ended on December 31, AD 9, covering the first nine years of the Common Era.\nIn Europe, the 0s saw the continuation of conflict between the Roman Empire and Germanic tribes in the Early Imperial campaigns in Germania. Vinicius, Tiberius and Varus led Roman forces in multiple punitive campaigns, before sustaining a major defeat at the hands of Arminius in the Battle of the Teutoburg Forest. Concurrently, the Roman Empire fought the Bellum Batonianum against a rebelling alliance of native peoples led by Bato the Daesitiate in Illyricum, which was suppressed in AD 9. A conflict also took place in Korea, where Daeso, King of Dongbuyeo invaded Goguryeo with a 50,000-man army in AD 6. He was forced to retreat when heavy snow began to fall, stopping the conflict until the next decade. In China, the last ruler of the Chinese Western Han dynasty (Ruzi Ying) was deposed, allowing Wang Mang to establish the Xin dynasty.\nLiterary works from the 0s include works from the ancient Roman poet Ovid; the Ars Amatoria, an instructional elegy series in three books, Metamorphoses, a poem which chronicles the history of the world from its creation to the deification of Julius Caesar within a loose mythico-historical framework, and Ibis, a curse poem written during his years in exile across the Black Sea for an offense against Augustus. Nicolaus of Damascus wrote the 15-volume History of the World.\nEstimates for the world population by AD 1 range from 170 to 300 million. A census was concluded in China in AD 2: final numbers showed a population of nearly 60 million (59,594,978 people in slightly more than 12 million households). The census is one of the most accurate surveys in Chinese history.",
    "grade": "The GRADE approach (Grading of Recommendations Assessment, Development and Evaluation) is a method of assessing the certainty in evidence (also known as quality of evidence or confidence in effect estimates) and the strength of recommendations in health care. It provides a structured and transparent evaluation of the importance of outcomes of alternative management strategies, acknowledgment of patients and the public values and preferences, and comprehensive criteria for downgrading and upgrading certainty in evidence. It has important implications for those summarizing evidence for systematic reviews, health technology assessments, and clinical practice guidelines as well as other decision makers.",
    "inductance": "Inductance is the tendency of an electrical conductor to oppose a change in the electric current flowing through it. The electric current produces a magnetic field around the conductor. The magnetic field strength depends on the magnitude of the electric current, and therefore follows any changes in the magnitude of the current. From Faraday's law of induction, any change in magnetic field through a circuit induces an electromotive force (EMF) (voltage) in the conductors, a process known as electromagnetic induction. This induced voltage created by the changing current has the effect of opposing the change in current. This is stated by Lenz's law, and the voltage is called back EMF.\nInductance is defined as the ratio of the induced voltage to the rate of change of current causing it. It is a proportionality constant that depends on the geometry of circuit conductors (e.g., cross-section area and length) and the magnetic permeability of the conductor and nearby materials.  An electronic component designed to add inductance to a circuit is called an inductor.  It typically consists of a coil or helix of wire.\nThe term inductance was coined by Oliver Heaviside in May 1884, as a convenient way to refer to \"coefficient of self-induction\". It is customary to use the symbol \n  \n    \n      \n        L\n      \n    \n    {\\displaystyle L}\n  \n for inductance, in honour of the physicist Heinrich Lenz. In the SI system, the unit of inductance is the henry (H), which is the amount of inductance that causes a voltage of one volt, when the current is changing at a rate of one ampere per second. The unit is named for Joseph Henry, who discovered inductance independently of Faraday.\n\n",
    "11in": "Guillermo Kahlo (born Carl Wilhelm Kahlo; 26 October 1871 – 14 April 1941) was a German-Mexican photographer. He photographically documented important architectural works, churches, streets, landmarks, as well as industries and companies in Mexico at the beginning of the 20th century; because of this, his work has not only artistic value but also historical and documental importance. He was the father of painter Frida Kahlo.",
    "caloric": "Caloric is a brand of kitchen appliances, which dates back to 1903.",
    "observables": "In physics, an observable is a physical property or physical quantity that can be measured. In classical mechanics, an observable is a real-valued \"function\" on the set of all possible system states, e.g., position and momentum. In quantum mechanics, an observable is an operator, or gauge, where the property of the quantum state  can be determined by some sequence of operations. For example, these operations might involve submitting the system to various electromagnetic fields and eventually reading a value.\nPhysically meaningful observables must also satisfy transformation laws that relate observations performed by different observers in different frames of reference. These transformation laws are automorphisms of the state space, that is bijective transformations that preserve certain mathematical properties of the space in question.\n\n",
    "agrees": "To \"agree to disagree\" is to resolve a conflict (usually a debate or quarrel) by having all parties tolerating but not accepting the opposing positions. It generally occurs when all sides recognize that further conflict would be unnecessary, ineffective or otherwise undesirable."
}